{"abstract": "AdaBoost algorithm based on Haar-like features can achieves high accuracy (above 95%) in object detection. Meanwhile massive computing power is needed to implement the cascaded classifiers involved in AdaBoost detection. To solve this problem, several dedicated hardware solutions have been proposed for real-time applications. In this work, a novel heterogeneous architecture of an AdaBoost detector is presented. This architecture achieves higher performance while consuming fewer hardware resources. By combining an integrated ARM Cortex-A9 processor with a dedicated accelerator, this architecture can be configured to realize various objects detection by simply loading different parameters. 2-D parallelism is involved in accelerator unit combination which brings more flexibility. This scheme is implemented on Xilinx ZC702 platform, the experiment result shows that 40 QVGA frames per second can be achieved for real-time face detection. The accelerator achieves more than 13 times improvement over the OpenCV implementation on a standalone Cortex-A9 w.r.t execution speed. Meanwhile, the accelerator consumes 40% less FPGA hardware resources than the prior-art implementation.", "authors": ["Zheng Xu", "Runbin Shi", "Zhihao Sun", "Yaqi Li", "Yuanjia Zhao", "Chenjian Wu"], "n_citation": 0, "references": ["0a11984c-ab6e-4b75-9291-e1b700c98d52", "1f4152a3-481f-4adf-a29a-2193a3d4303c", "3c2ddf0a-237b-4d17-8083-c90df5f3514b", "522ce553-29ea-4e0b-9ad3-0ed4eb9de065", "579e5f24-5b13-4e92-b255-0c46d066e306", "5d0b987d-eed9-42ce-9bf3-734d98824f1b", "80656b4d-b24c-4d92-8753-bdb965bcd50a", "d6e37fb1-5f7e-448e-847b-7d1f1271c574"], "title": "A Heterogeneous System for Real-Time Detection with AdaBoost", "venue": "high performance computing and communications", "year": 2016, "id": "001eef4f-1d00-4ae6-8b4f-7e66344bbc6e"}
{"abstract": "In this paper, a kind of novel jigsaw EBG structure is designed and applied into conformal antenna array. The stop band of jigsaw EBG structure is simulated. And the 4-element antenna array with Taylor amplitude distribution is considered. The effect of EBG structure on the side-lobe level of antenna array radiation pattern is investigated.", "authors": ["Yufei Liang", "Yan Zhang", "Tao Dong", "Shan-wei Lu"], "n_citation": 0, "references": ["001eef4f-1d00-4ae6-8b4f-7e66344bbc6e"], "title": "A novel conformal jigsaw EBG structure design", "venue": "international conference on conceptual structures", "year": 2016, "id": "002e0b7e-d62f-4140-b015-1fe29a9acbaa"}
{"abstract": "This paper studies the problem of using an autonomous underwater vehicle (AUV) to seek the source of some signal in the underwater environment. To avoid the redundant travels for getting the local gradient in existing methods, we propose a novel source-seeking strategy in which the AUV keeps updating an estimated field model using measurements along its gradient-climbing path. Based on the convergence results of the sequential least-squares field estimation algorithm and the path planning method by nonlinear programming, the AUV will finally reach a maximum of the field which indicates a potential source. The way-point tracking control of the AUV is realized by a nonlinear model predictive control (NMPC) scheme embedded with the line-of-sight (LOS) guidance law. The effectiveness and efficiency of the proposed source-seeking strategy is validated in the simulation experiment with a real AUV model.", "authors": ["Xiaodong Ai", "Keyou You", "Shiji Song"], "n_citation": 0, "references": ["1862a08a-08c6-4ab1-a214-8932bbd0d2d9", "7bcea2f7-6006-4a4d-8529-3593fa56d2dc", "c1959b6f-8bab-49a2-ae2f-066c43cfc9c9", "d65d26b4-a0e0-4112-ae22-2f3a4b51d7b3", "e66104e4-31fd-43d6-a056-f52bf8ae7eee"], "title": "A source-seeking strategy for an autonomous underwater vehicle via on-line field estimation", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "00352759-f0a7-4678-82ae-fed68c700da6"}
{"authors": ["Francine Berman", "Vinton G. Cerf"], "n_citation": 0, "references": [], "title": "Social and ethical behavior in the internet of things", "venue": "Communications of The ACM", "year": 2017, "id": "00f77fa9-ae49-4935-9166-2f5f9cdb3d6b"}
{"authors": ["Leon A. Sakkal", "Kyle Z. Rajkowski", "Roger S. Armen"], "n_citation": 50, "references": ["4f4f200c-0764-4fef-9718-b8bccf303dba", "aa699fbf-fabe-40e4-bd68-46eaf333f7b1","001eef4f-1d00-4ae6-8b4f-7e66344bbc6e"], "title": "Prediction of consensus binding mode geometries for related chemical series of positive allosteric modulators of adenosine and muscarinic acetylcholine receptors", "venue": "Journal of Computational Chemistry", "year": 2017, "id": "013ea675-bb58-42f8-a423-f5534546b2b1"}
{"authors": ["Nuno Moniz", "Luís Torgo", "João Vinagre"], "n_citation": 0, "title": "Data-Driven Relevance Judgments for Ranking Evaluation.", "venue": "", "year": 2016, "id": "01413023-7ed6-4964-b7c8-19259f84a1db"}
{"abstract": "This paper presents a methodology to analyze linguistic changes in a given textual corpus allowing to overcome two common problems related to corpus linguistics studies. One of these issues is the monotonic increase of the corpus size with time and the other one is the presence of noise in the textual data. In addition, our method allows to better target the linguistic evolution of the corpus, instead of other aspects like noise fluctuation or topics evolution. A corpus formed by two newspapers, \"La Gazette de Lausanne\" and \"Le Journal de Gen\\`eve\", is used, providing 4 million articles from 200 years of archives. We first perform some classical measurements on this corpus in order to provide indicators and visualizations of linguistic evolution. We then define the concept of a lexical kernel and word resilience, to face the two challenges of noises and corpus size fluctuations. This paper ends with a discussion based on the comparison of results from linguistic change analysis and a concludes with possible future works continuing in that direction.", "authors": ["Vincent Buntinx", "Cyril Bornet", "Frédéric Kaplan"], "n_citation": 0, "references": ["426b57a8-2e7d-498d-9a57-c09983ae0699", "6499d572-7819-47bf-9087-bd201c31cea1", "db81cd6e-3a7a-4088-b254-92f924a4e379","001eef4f-1d00-4ae6-8b4f-7e66344bbc6e"], "title": "Studying Linguistic Changes over 200 Years of Newspapers through Resilient Words Analysis", "venue": "Frontiers in Digital Humanities", "year": 2017, "id": "01522369-3b88-4256-99d4-4e0c1de9f1ba"}
{"abstract": "Boneh and Durfee (Eurocrypt 1999) proposed two polynomial time attacks on small secret exponent RSA. The first attack works when d  0.284  whereas the second attack works when d  0.292 . Both attacks are based on lattice based Coppersmith's method to solve modular equations. Durfee and Nguyen (Asiacrypt 2000) extended the attack to a variant of RSA where prime factors are not the same sizes. However, the attack extended only the first attack of the Boneh-Durfee. Hence, an open problem remains, i.e., if the Boneh-Durfee second attack can be extended to unbalanced RSA. In this paper, we propose a desired attack that extended the Boneh-Durfee second attack. Our proposed attack fully improves the Durfee-Nguyen attack for all size of prime factors. The improvement stems from our technical lattice construction. Although Durfee and Nguyen only analyzed lattices whose basis matrices are triangular, we analyze broader classes of lattices that contain non-triangular basis matrices. The analysis can be performed by using the unravelled linearization proposed by Herrmann and May (Asiacrypt 2009) and the transformation on the Boneh-Durfee lattices proposed by Takayasu and Kunihiro (PKC 2016). As a result, we can exploit useful algebraic structure compared with the Durfee-Nguyen.", "authors": ["Atsushi Takayasu", "Noboru Kunihiro"], "n_citation": 0, "title": "Small secret exponent attacks on RSA with unbalanced prime factors", "venue": "international symposium on information theory and its applications", "year": 2016, "id": "01537b60-9ae2-4684-a1fa-e688e7757e6f"}
{"abstract": "Container identification and recognition is still performed manually or in a semi-automatic fashion in multiple ports globally. This results in errors and inefficiencies in port operations. The problem of automatic container identification and recognition is challenging as the ISO standard only prescribes the pattern of the code and does not specify other parameters such as the foreground and background colors, font type and size, orientation of characters (horizontal or vertical) so on. Additionally, the corrugated surface of container body makes the two dimensional projection of the text on three dimensional containers slanted and jagged. We propose a solution in the form of an end-to-end pipeline that uses Region Proposals generated based on Connected Components for text detection in conjunction with Spatial Transformer Networks for text recognition. We demonstrate via our experimental results that the pipeline is reliable and robust even in situations when the code characters are highly distorted and outperforms the state-of-the-art results for text detection and recognition over the containers. We achieve text coverage rate of 100% and text recognition rate of 99.64%.", "authors": ["Ankit Verma", "Monika Sharma", "Ramya Hebbalaguppe", "Ehtesham Hassan", "Lovekesh Vig"], "n_citation": 0, "references": ["3e3a4245-eb62-4769-bc84-1001479df701", "42f6b977-ec16-48be-a8f2-af53b8522be1", "46aeba51-c989-4cf8-927e-928dadcef872", "5647dca2-7978-40a9-bc7b-376d232a068a", "70d88ef5-1fe3-4df8-a9af-becc2bb17a75", "742181ff-4a0a-46ca-b32c-aab50dd7c3c7", "786b4b62-32d5-4be0-b7e3-aa5c3647d376", "9b2aa4f0-a196-46e3-8ab1-c7fd6788d9a4", "a9f2c948-4bb2-4f19-9484-3a01cc4249fc", "afa0804e-da05-48f0-ade9-47996e4df4d2", "d19e9c93-9bb8-4936-9275-c7fbff937079", "e8f80f7b-0406-4c69-b64d-fed6ef59ecc7", "e9743240-779d-4ff8-bb78-b778fa701713"], "title": "Automatic Container Code Recognition via Spatial Transformer Networks and Connected Component Region Proposals", "venue": "international conference on machine learning and applications", "year": 2016, "id": "017440d5-6ba8-422a-bd7a-d59e3b9a4e77"}
{"abstract": "This paper analyzes the current active Medical Tourism websites and discusses the availability of various features among these websites. The analysis is based on the collected data about the features' importance and users' online search patterns from people have experiences in Medical Tourism and medical information search on the Internet. This study focuses on the Medical Tourism market in Thailand due to its popularity and high ranking among other international Medical Tourism destinations. A Medical Tourism aggregative system is proposed by using one of the Data Mining tools - Association Rule.", "authors": ["Elaine Vedrasco", "Chidchanok Lursinsap"], "n_citation": 0, "references": ["472b9486-b98a-4972-8252-b1eacbaf52a7", "572457cf-fcf7-40ff-a72c-6776b00c6ef7", "76ce1455-926e-457b-8754-1b38d770ca08", "86623ef4-060b-421e-bb7f-d36a5e268d43", "866a428a-b24b-409d-af75-b31721572760", "001eef4f-1d00-4ae6-8b4f-7e66344bbc6e", "97549697-2cbf-4ae0-92d5-38fa7fa25b58", "976b29e2-47bd-4a66-a36a-37f3e077fb95", "bf5b864a-08cc-4b32-a9da-dff8acd97f00", "e3f27652-688a-457b-ad96-07a7e3c05543"], "title": "Effective solution for a medical tourism aggregative system using the data mining approach", "venue": "", "year": 2016, "id": "01dcc2e7-fda1-483d-9a5c-10e9cf985951"}
{"abstract": "For stereoscopic optical see-through head-mounted display calibration, existing methods that calibrate both eyes at the same time highly depend on the HMD user's unreliable depth perception. On the other hand, treating both eyes separately requires the user to perform twice the number of alignment tasks, and does not satisfy the physical structure of the system. This paper introduces a novel method that models physical structure as additional constraints and explicitly solves for intrinsic and extrinsic parameters of the stereoscopic system by optimizing a unified cost function. The calibration does not involve the unreliable depth alignment of the user, and lessens the burden for user interaction.", "authors": ["Long Qian", "Alexander Winkler", "Bernhard Fuerst", "Peter Kazanzides", "Nassir Navab"], "n_citation": 50, "references": ["076bca9b-b30c-4c2c-8148-3b9b5d9aa939", "6b5cf401-1b90-4d68-b44e-2fe6cc54c93f", "82db7f4a-3c8e-42c3-b852-41f751248251", "9a5f6827-098c-46ed-a4c7-ae0590dd2342", "fb5bde78-2255-469d-a735-adb8409a2715"], "title": "Modeling Physical Structure as Additional Constraints for Stereoscopic Optical See-Through Head-Mounted Display Calibration", "venue": "international symposium on mixed and augmented reality", "year": 2016, "id": "01f02fae-97df-4207-a386-a1bc8ec0853b"}
{"abstract": "Without requiring time synchronization, protocol sequences can be used to design a simple and reliable channel access protocol for mobile ad hoc networks. This paper focuses on completely irrepressible (CI) sequences, which can be employed to allow each user to have at least one successful packet transmission within each sequence period for a completely asynchronous channel. Previous numerical studies have shown by using carefully designed CI sequences, the average delay performance can be improved than using ALOHA-type schemes. To gain a unique insight into the characteristics of the protocol, we present an analytical model for the delay performance of CI sequences. The accuracy of our analytical model is verified via numerical results.", "authors": ["Aijie Zou", "Yuxuan Fang", "Fengyu Guan", "Yijin Zhang", "Chang-Hong Fu", "Hongyuan Chen", "Feng Shu"], "n_citation": 0, "references": ["0b92c76b-86f0-4b8b-a0ff-138cbae8340f", "0d11abd8-c2f8-489f-bf87-234bd0dab697", "115b2803-a506-42f3-8b2c-f91f7e599dee", "2de3834f-ebc5-41b8-aba7-748a3e013a2e", "2fdfb2a1-59ec-4aeb-97fc-40fc9fbe90ec", "4f183e41-3270-4345-9234-3070ea2e4406", "7decfb83-998e-4bad-a36d-09380ca810ff", "d0b8fa14-ad90-4625-8829-df4c4aeca28a", "d10f36a0-8604-4b03-a290-a31c5f4e5cd1", "d3e031ae-0189-4c87-8600-dea5d98f3224", "dfb5d5e2-5e2b-40bc-8e3d-7321220a044e", "f51e9623-aa6c-4878-858d-8de7cf43eec9", "fda171de-9fe9-4e7e-88b1-05f4b9ba1a2a"], "title": "Delay analysis of completely irrepressible sequences for mobile ad hoc networks", "venue": "international conference on conceptual structures", "year": 2016, "id": "029bb71a-6b91-43a5-8a83-ce56b544204b"}
{"authors": ["Ioanna Ersi Pervolaraki", "Emmanouel Garoufallou", "Rania Siatri", "Georgia Zafeiriou", "Sirje Virkus", "Stavroula Antonopoulou"], "n_citation": 0, "references": ["2151fe5c-ec30-40d5-bf75-a428b1be8250", "e719a43c-1a1c-4c2f-83b0-66227fab2012"], "title": "Use of Digital Tools by Preschool Children: Preliminary Results.", "venue": "", "year": 2016, "id": "02a643f8-93f3-469f-8c24-2ffc5c9b7129"}
{"authors": ["Kazuhiro Homma", "Kiyoyuki Chinzei", "Koji Hyodo"], "n_citation": 0, "title": "MR Imaging Method for Measurement of Local Dynamics in Human Tissues.", "venue": "", "year": 1994, "id": "02e81c9e-f2ae-4335-b2e2-416eb95df3ac"}
{"abstract": "This work establishes a scalable, easy to use and efficient approach for exploiting SIMD capabilities of modern CPUs, without the need for extensive knowledge of architecture specific instruction sets. We provide a description of a new API, known as UME::SIMD, which provides a flexible, portable, type-oriented abstraction for SIMD instruction set architectures. Requirements for such libraries are analysed based on existing, as well as proposed future solutions. A software architecture that achieves these requirements is explained, and its performance evaluated. Finally we discuss how the API fits into the existing, and future software ecosystem.", "authors": ["P. Karpiński", "John McDonald"], "n_citation": 0, "references": ["65cbef5a-007f-436f-9044-ffc09b1d2df1", "aac1e6b2-a2c2-45c1-8935-bcc96680cd23", "cafafa28-f85a-4331-917c-8851ea044826", "e0f45975-a3d5-4b84-b106-93ce2e198e6b"], "title": "A high-performance portable abstract interface for explicit SIMD vectorization", "venue": "", "year": 2017, "id": "0361b05e-9bca-42d1-af6c-49905e5eb7cb"}
{"abstract": "Transforming deterministic $\\omega$-automata into deterministic parity automata is traditionally done using variants of appearance records. We present a more efficient variant of this approach, tailored to Rabin automata, and several optimizations applicable to all appearance records. We compare the methods experimentally and find out that our method produces smaller automata than previous approaches. Moreover, the experiments demonstrate the potential of our method for LTL synthesis, using LTL-to-Rabin translators. It leads to significantly smaller parity automata when compared to state-of-the-art approaches on complex formulae.", "authors": ["Jan Křetínský", "Tobias Meggendorfer", "Clara Waldmann", "Maximilian Weininger"], "n_citation": 0, "references": ["0c781683-b162-45b5-8a0a-5188238ef1c6", "3ebf499b-c870-4256-9721-12d53f86c4ed", "5fc26abc-4325-415e-9ded-fb84cee2cfc8", "5fffd378-7385-425c-a445-f17380db02c9", "737eb6ec-5c86-4e63-baca-fadaf07d4046", "74e3fd8b-f955-4fde-aad8-0a705f05e27e", "83fa4cb3-9d63-4045-bfc2-06bfa8eec305", "98f75cd7-a8d9-4aa2-aedf-17854c31b90a", "a35929d4-2cf6-443b-935b-98150de57b56", "a683136e-1411-431b-8257-507891fff09a", "b7143e77-0b05-4448-9bfe-02a6323532b2", "d566771b-688d-46c1-9588-7f611deb4238", "df8ed6f9-a3b0-4d26-83a1-6eb1e025f870", "ecc7c034-f91e-4a75-9b6b-630e93503a1a", "f2d7e368-8a58-4e5c-826d-fa714cc000f8", "fd9ddd9d-583f-4eb6-8cbe-90722c8587a1"], "title": "Index Appearance Record for Transforming Rabin Automata into Parity Automata.", "venue": "tools and algorithms for construction and analysis of systems", "year": 2017, "id": "037d2e92-a3b1-406e-a344-a9fbd8c57bc5"}
{"abstract": "The relevance of local knowledge in cultural heritage is by now acknowledged. It helps to determine many community-based projects by identifying the material to be digitally maintained in multimedia collections provided by communities of volunteers, rather than for-profit businesses or government entities. Considering that the search and browsing of texts, images, video, and 3D models related to places is more essential than using a simple text-based search, an interactive multimedia map was implemented in this study. The map, which is loaded on a single HyperText Markup Language (HTML) page using AJAX (Asynchronous JavaScript and XML), with a client-side control mechanism utilising jQuery components that are both freely available and ad-hoc developed, is updated according to user interaction. To simplify the publication of geo-referenced information, the application stores all the data in a Geographic JavaScript Object Notation (GeoJSON) file rather than in a database. The multimedia contents—associated with the selected Points of Interest (PoIs)—can be selected through text search and list browsing as well as by viewing their previews one by one in a sequence all together in a scrolling window (respectively: “Table”, “Folder”, and “Tile” functions). PoIs—visualised on the map with multi-shape markers using a set of unambiguous colours—can be filtered through their categories and types, accessibility status and timeline, thus improving the system usability. The map functions are illustrated using data collected in a Comenius project. Notes on the application software and architecture are also presented in this paper.", "authors": ["Nicola Maiellaro", "Antonietta Varasano"], "n_citation": 0, "references": ["49365bcd-f1aa-4f6e-9ab2-597d0fcfc28f", "5baa4a60-4a82-49c8-84b4-34031203df26"], "title": "One-Page Multimedia Interactive Map", "venue": "", "year": 2017, "id": "0391f5e3-13f4-4984-afbc-82ebd59c5936"}
{"authors": ["Marta Nuñez-Garcia", "David Andreu", "Marta Male", "F.J. Alarcón", "Lluis Mont", "Constantine Butakoff", "Oscar Camara"], "n_citation": 0, "references": ["456717b7-c5f9-4d65-a2e6-83ce70378c5f", "7ea2c02c-c3cf-4a1e-8281-09f1f38599f7", "a5378aed-4361-47ee-8ae7-584b8c3b669d", "d66a68b3-c72b-4d4b-b406-57f3a6547bb1"], "title": "Standardised Framework to Study the Influence of Left Atrial RF Catheter Ablation Parameters on Permanent Lesion Formation", "venue": "", "year": 2016, "id": "03c06fcc-017a-4138-81f4-86f7237cabfd"}
{"abstract": "In this work, we consider a Zigbee wireless sensor network and study the effect of different network topologies on quality of service metrics such as throughput, end-to-end delay, and packet dropping. A campus building is selected as an experimentation testbed, where several end devices are placed, together with routers and a single coordinator. In this setup, the performance of Zigbee communication protocol was simulated using the OPNET Modeler simulation tool. Measurements of QoS metrics were obtained under different topologies, in order to quantify the complex effects of topology control on aggregate load, throughput, delay, and packet dropping. The results suggest that an increase in the number of routers in the network leads to a significant increase in network load and end-to-end delay, but at the same time offers higher throughput and minimum number of dropped packets.", "authors": ["Maria Dimou", "Theofilos Kossyvakis", "Costas Chaikalis", "Konstantinos P. Tsoukatos", "Charalampos Liolios", "Vasileios Vlachos"], "n_citation": 0, "references": ["35fc2508-4727-4ae9-a00c-8c00e70a9a80", "b2ccb628-0c27-48cf-8b5e-291ab25b9117", "d44dd4fe-ca1d-4fde-855a-1548de68b836", "dfc9f1b0-a952-42e2-bc5e-c5d78c053d2d", "f93520e8-c84e-4c9e-b6ad-bd8892ae5bd0"], "title": "Topology Experimentation in a Zigbee Wireless Sensor Network", "venue": "panhellenic conference on informatics", "year": 2016, "id": "03d34ab5-a275-444e-a85b-c46f09c357f0"}
{"abstract": "Ever-evolving malware continues to flood the Internet at an alarming rate. This makes it challenging for security organizations and anti-malware vendors to devise effective solutions. It is, therefore, imperative to study automated tools and techniques for quick detection of malware, possibly limiting or preventing any impact on the target. The code or behavioural patterns obtained from malware analysis can be used to classify new malware samples into their existing families and recognize those which possess unknown behaviour and thus need a closer manual inspection. This paper provides a comprehensive review of techniques and tools currently employed for malware analysis and classification. It includes the comparison of tools and techniques for collecting malware, analyzing them statically and dynamically for extracting features and finally classifying these using machine learning methods. It also provides the examples from the literature that analyze executables for extracting useful features and apply machine learning for discriminating malicious software from benign ones.", "authors": ["Ekta Gandotra", "Divya Bansal", "Sanjeev Sofat"], "n_citation": 0, "title": "Tools & Techniques for Malware Analysis and Classification", "venue": "", "year": 2016, "id": "03f1c773-c072-4011-9455-1f34c64e929d"}
{"authors": ["Erwan Bousse", "Manuel Wimmer", "Wieland Schwinger", "Elisabeth Kapsammer"], "n_citation": 0, "title": "On Leveraging Executable Language Engineering for Domain-Specific Transformation Languages.", "venue": "", "year": 2016, "id": "0458b983-901d-49c1-85f8-8aa1eacc8a8b"}
{"abstract": "A network embedding is a representation of a large graph in a low-dimensional space, where vertices are modeled as vectors. The objective of a good embedding is to preserve the proximity between vertices in the original graph. This way, typical search and mining methods can be applied in the embedded space with the help of off-the-shelf multidimensional indexing approaches. Existing network embedding techniques focus on homogeneous networks, where all vertices are considered to belong to a single class.", "authors": ["Zhipeng Huang", "Nikos Mamoulis"], "n_citation": 0, "references": ["0613c93b-e309-4247-844c-15b8e651f7d6", "087f5698-5bf0-4a04-baa3-c13547b9e9f1", "12f40b38-cd99-4801-8074-d765a29a2101", "28994c1f-f220-4156-a6da-17cff4a55a61", "29dec249-248e-405e-95ad-25212dbca08f", "2e5c3b78-91b8-43d6-b2bb-bb2c861c564c", "51cfdd10-1566-4380-adae-3889630ebaf4", "5a7ff0d4-5f7e-4dfa-87ba-79044a7096e0", "5fbfc090-9a2c-43c5-a5c8-1deea2e4d30c", "71b62008-1731-4491-b34c-9f223bae846f", "72836b7e-edd1-4fb1-ac42-2306b646599c", "7f6f7910-fa04-4993-9fa7-eface233f45a", "8e5a5082-4516-4d61-9511-7b5a08011441", "914ab6f3-868b-45dd-baa8-7c160b687f54", "9bd3b8dd-728e-4476-a3b8-f7b08f51bb78", "9cad8f91-f755-49ee-8521-69cf39240b0f", "a5fc8aed-b007-4ed1-92ee-81fad0dc67d2", "c074b2bd-e180-4a80-8ae3-109ebff35e8f", "c186e8f6-42e1-4bb8-8fe3-039e0cd02532", "c5c591ef-2cb9-4eb9-9c06-f2b7b8725a73", "cbff2ff2-6b8f-425d-a5ef-aff0de9be3e5", "ccc91c53-bb9c-4b35-a09c-4407e34dfd35", "e20ac065-c949-4f62-81ce-8c9c9db36a8d", "f3756ece-68c5-4626-aa4f-35fe6f015c6c", "f6e6c928-7f9c-45e4-871a-8b428369f97c", "f9b6cdb9-cc7b-4981-a93d-b0b08a96285b", "fef6ba5f-dcc5-4355-a09f-140aba3637fe"], "title": "Heterogeneous Information Network Embedding for Meta Path based Proximity", "venue": "arXiv: Artificial Intelligence", "year": 2017, "id": "04cd6546-ed71-4fec-899e-9e411b75975f"}
{"abstract": "Metaheuristics, such as Genetic Algorithms (GAs), and hyper-heuristics have been widely studied and applied in the literature. This led to the development of several frameworks to aid the execution and development of such algorithms. Consequently, the reusability, scalability and maintainability became fundamental points to be attacked by developers. Such points can be improved using Design Patterns, but despite their advantages, few works have explored their usage with metaheuristics and hyper-heuristics. In order to contribute to this research topic, we present a solution based on the Visitor pattern used to design genetic operators. A case study is presented with the Hyper-heuristic for the Integration and Test Order problem (HITO). This case study shows that the proposed solution can increase the reusability of the implemented operators, and also enable easy addition of new genetic operators and representations.", "authors": ["Giovani Guizzo", "Silvia Regina Vergilio"], "n_citation": 0, "references": ["16bc6bb0-748a-4272-ae22-32b5b1538321", "1d111ef9-6b14-4af7-b49b-f1a1a5c0f11a", "43cb5f98-9813-42ff-845b-0171a67943b0", "45913319-0e7c-42e4-8a25-ac2124c373f5", "72508eaa-e394-4e9c-8324-63ffb5a9cd7b", "7480f0fe-f18c-4ae9-b47a-0dc4340f927f", "7decfecd-eed2-4add-8b5d-726e9c50c244", "a74f9944-5d5f-4e70-ae6b-ad90c10b6502", "c4eb7c15-5002-4f0e-969a-56511496e88d", "cd42f327-6765-4767-969e-abfa55d58763", "d326127b-32ca-42f8-8194-856fb5b66fdb", "da25b6b0-9637-4422-9ad7-f766597785dc", "dca57849-52b1-495b-b142-33d1974c90f3", "f273d116-f7c4-486e-ba3c-bbefa620513d", "f7637c3e-5153-4d81-bb9c-dd4f2c8d4118"], "title": "Metaheuristic Design Pattern: Visitor for Genetic Operators", "venue": "", "year": 2016, "id": "04d72bcc-7998-4a8d-8fe9-8ff3dab793a4"}
{"authors": ["Dejana Golenko", "Kornelija Petr Balog", "Ljiljana Siber"], "n_citation": 0, "references": ["314357ce-ecbe-45ed-8c06-c55aa20afa4c"], "title": "Information Literacy Programs in the Field of Law: Case Study of Two Law Faculties in Croatia", "venue": "", "year": 2016, "id": "04e7b47e-af0b-40e6-8632-f5c79d494719"}
{"authors": ["Lydia Y. Chen", "Robert Birke", "Evgenia Smirni"], "n_citation": 0, "references": ["4176c232-fa9d-4540-a778-d2fe285cd2ae", "84e25c01-d8a6-4408-8987-6e9ff310fc80", "9225b3b0-3151-460c-ab8d-0e697aecb896", "bf551944-acd9-4885-973c-d643810b543f", "cd4058f9-c324-4b8c-bdc0-db940cfbcdd7", "cd46bb67-0755-4fb4-ba84-086227c4f529"], "title": "State of Practice of Non-self-aware Virtual Machine Management in Cloud Data Centers", "venue": "", "year": 2017, "id": "054ee4ba-df31-4662-8869-cd842d0a3c1e"}
{"abstract": "Betweenness centrality is a popular metric in social science, and recently it was adopted also in computer science. Betweenness identifies the node, or the nodes, that are most suitable to perform critical network functions, such as firewalling and intrusion detection. However, computing centrality is resource-demanding, we can not give for granted that it can be computed in real time at every change in the network topology. This is especially true in mesh networks that generally use devices with few computation resources. This paper shows that using the fastest state-of-the-art heuristic algorithm it is indeed possible to compute network centrality even in real, low-power networking hardware in a network made of up to 1000 nodes. Not only, observing the behavior of a real mesh network it shows that centrality does not need to be updated at every topology change, but it can be safely re-computed with an interval in the order of the tens of minutes. Our findings confirms that centrality can be effectively and successfully used as a building block for security functions in mesh networks.", "authors": ["Leonardo Maccari", "Quynh Nguyen", "Renato Lo Cigno"], "n_citation": 0, "references": ["03a2eb6c-8a96-468e-b79f-282d069a4824", "063390a2-f032-473b-9806-db49733becdd", "1dc91e45-5985-4fd5-b62c-2b2df7c22b30", "22ea44eb-8d96-4bfc-aea4-94362672b98f", "28d2789b-7924-470a-9ec7-34363e00c975", "2c8e7e31-db3c-4207-8b28-ee8e2910dd87", "2ea644c7-5598-40fb-8afa-043ab2bfd529", "46adcb49-cb4d-4370-b0d2-50ec87f27cc9", "555fc5aa-69a3-473f-b7a3-2a2e69deb835", "631fa5b4-ccd0-4f8d-81dd-5b27fb10052b", "7b2e7ba1-1bb4-4d21-8120-fa84a27b6e84", "84d108d4-c2a5-4531-9dcf-39ede987bccf", "a2f6bc97-abdd-4f23-b2d1-7f57fab1429c", "b233c983-a938-4aeb-a375-d2900d101d24", "bb0cf3d2-3c83-465e-81df-c7f1bf7c7bd8", "befe08a2-967a-4846-a16a-db0f74d190c5", "c574452b-32e8-41e6-9c62-a9d3b05a5e6b", "c97e6efd-0469-4fcd-af6e-d9093fbb598f", "d49d8c12-a22d-41cb-bbed-3c03afd255eb", "ddcbdf0b-7da1-4ec0-80dd-be302a5fa8c3"], "title": "On the Computation of Centrality Metrics for Network Security in Mesh Networks", "venue": "global communications conference", "year": 2016, "id": "055c731d-eead-439a-bec4-f2028968cc31"}
{"abstract": "In this paper, we motivate the utility of framing very common data analysis and business intelligence problems as a problem in understanding the differences between two datasets. We call this framework the Difference-of-Datasets (DoD) framework. We propose a simple and effective method to help find the root causes of changes, i.e. “Why did the observed change happen?” or “What drove the observed change?”. Our method is based on a hypothesis test to detect the difference in the distributions of two samples, and is tailored to large-scale correlated binary data. We apply our method to several interesting scenarios, and successfully get insights to approach the fundamental reasons for unexpected changes. While our method originates from the concepts in A/B testing, it could be extended to all areas related to data science and business intelligence.", "authors": ["Paul Raff", "Ze Jin"], "n_citation": 0, "references": ["1f35f20b-a760-47b6-8877-4ed53b69f6a1", "30db7a2d-e7c0-4bf0-87d5-253e13ccac96", "3875b02b-0333-4433-8d97-c3105394c36d", "48e1100d-588d-4716-a728-4e7062a13e79", "657d6ff2-9d0b-4558-8eeb-e6991120ddf5", "7e374bc3-54f4-4a05-a467-f0e7dd3ec059", "92ccbc72-cbaf-4258-b839-ba34c61205d7", "cc7b3b77-fef5-48f5-863a-3bdaed3f43f3", "d740fce7-beef-407b-9160-9bf0f1d8baf4", "dec1020f-eb37-4f1d-80fc-b745138549c8", "ebc3e1a7-dc06-4a76-95a9-d721f2fbef05", "f55ba15e-33c9-463e-b403-100a8dd0a476"], "title": "The difference-of-datasets framework: A statistical method to discover insight", "venue": "", "year": 2016, "id": "05944f08-b0df-47b8-bb44-23a63cf6a9a8"}
{"authors": ["Gregory W. Hislop", "Massood Towhidnejad", "William M. Marcy"], "n_citation": 0, "title": "Work in progress - Vertically integrated teams to inspire student interest in computing.", "venue": "", "year": 2011, "id": "05c04c97-a735-4f63-ac35-18a2f88d8cb4"}
{"abstract": "Time-Triggered Ethernet (TTEthernet) improved from Avionics Full Duplex Switched Ethernet (AFDX) is supposed to enhance the determination by introducing time-triggered mechanism, while indeterminacy problem still exists in rate-constrained (RC) flows thus requiring worst-case latency analysis. Traditional network calculus model used for AFDX is not suitable for TTEthernet due to time-triggered (TT) flow mandatory competition for network resource. In this paper, we derive formula of traffic delay for RC flows in TTEthernet with intensive TT-schedule schema under the condition of preemption transmission mode, expand performance analysis scope to support multi-priority flows through assuming TT flow as the highest-priority RC flow when considering the pessimism of scheduling and verify the practicability of modified model by calculating its algorithmic complexity. Experiments show that our model gives effective latency upper bound which is slightly beyond exact value but no more than 16.7% and sustains rapid calculation for a real complicated network configuration within 3 seconds compared with other existing models.", "authors": ["Xuan Zhou", "Feng He", "Tong Wang"], "n_citation": 0, "references": ["03a8b814-c726-4430-9422-6e5cb121c739", "03b061cb-7a35-4636-9c99-509e20484747", "13c5e77b-b809-47c5-a5f8-b555a25dbd24", "3ee36ffd-3eb1-470c-8e96-ea173b0794cf", "56c0195f-6267-464b-b3c0-824aa08e374f", "57d658af-322f-4f0e-a513-233d18d4a0c6", "63679ba2-2da9-4ccb-9303-7f2a37a316ea", "6f82b075-1db0-4f45-8dc5-2493b9d7840a", "8bd55ba5-dda7-45a4-8982-f1f45d56a2eb", "ba392c68-9663-49e5-85b0-2e1e2c84300d", "bf369f96-eb45-4b95-8355-f35a8a8012c6", "edcc5acc-91bf-4b59-96b5-eda6be35843a", "fdec83b0-ebd2-4605-869b-9862b666a157"], "title": "Using network calculus on worst-case latency analysis for TTEthernet in preemption transmission mode", "venue": "", "year": 2016, "id": "05de0628-5f0d-4c54-a8df-986c135d0a7e"}
{"abstract": "For the multiterminal secret key agreement problem, new single-letter lower bounds are obtained on the public discussion rate required to achieve any given secret key rate below the secrecy capacity. The results apply to general source model without helpers or wiretapper's side information but can be strengthened for hypergraphical sources. In particular, for the pairwise independent network, the results give rise to a complete characterization of the maximum secret key rate achievable under a constraint on the total discussion rate.", "authors": ["Chung Chan", "Manuj Mukherjee", "Navin Kashyap", "Qiaoqiao Zhou"], "n_citation": 50, "references": ["19eb4d23-c01f-484a-ad86-0f1061622295", "205c230b-da88-43fb-b5ad-d1dbd89f9eed", "3f5b52ce-03c4-44f0-bc93-02af2d30ca9b", "5743fa09-b4a5-4005-97bf-6f6d60d7f53d", "773140de-2995-4e3e-8ed2-120bbd93c9e8", "7ae6cf1c-5599-4f00-a0d1-995e88b15948", "898d8fd3-f3df-4c60-b03d-49e40072f666", "a319b177-7776-4143-8e88-b548ddda5b8a", "ba835661-2272-444d-be20-e56862698536", "c5b4b17a-c74d-40ef-986b-40facda637ab", "c5c9633f-2313-4fe8-bb3d-f9df63423d3d", "f07a6e52-c17b-4254-99af-00dd1e3dc7a9", "fa7c6cca-fd3f-4764-9e1a-21f3fecc8b30"], "title": "Secret Key Agreement under Discussion Rate Constraints", "venue": "arXiv: Information Theory", "year": 2017, "id": "0600c67e-71a1-4ed2-913f-e9db02370de4"}
{"abstract": "The development of Advanced Driver Assistance Systems (ADAS), such as pedestrian detection, requires real-time update rates at high image resolution. Hopefully, heterogeneous architectures with high computing performance have been developed for this purpose. To benefit from this hardware performance, different programming languages and acceleration frameworks have been developed. OpenVX framework provides a graph-based execution model to program image processing algorithms on heterogeneous platforms. In this work, we investigate OpenVX optimizations for computer vision applications. We examine how this framework responds to different data access patterns. We test three important optimizations of OpenVX: kernels merge, data tiling and parallelization via OpenMP. The contribution and the impact of each optimization on different data access pattern are explained.", "authors": ["Djamila Dekkiche", "Bastien Vincke", "Alain Merigot"], "n_citation": 0, "references": ["08082d24-4cf9-41d2-98f7-3ae85df297a8", "28323bfc-f269-4778-9927-60a5931e0bc1", "488a6295-0665-4039-9842-da199231e5e0", "56dedd88-8542-4ebe-9d96-05517a559593", "62d3ed95-18d5-4c3d-af89-b65b8eb35d36", "b1f52e8e-84c0-4d62-af2e-9bb392d711a7", "b3849367-0a36-4a57-8440-434a7c0fdcbb", "e14f07cb-6644-4e95-8c39-aab3c7038878"], "title": "Investigation and performance analysis of OpenVX optimizations on computer vision applications", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "06a4064e-54f7-4092-a7e0-a1bdddb00bc0"}
{"abstract": "This paper describes the design of a distributed architecture to support an interactive, interoperable, and collaborative forest fire fighting simulation using High Level Architecture (HLA). Based on the Run-time Infrastructure (RTI) services which are specified in HLA and C++ application programming interface (API) of the RTI, The distributed virtual fire fighting environment provides a practical foundation to enhance interactivity, interoperability for distributed simulation.. Users can build new federation application by the way of the goal system reorganization. The key techniques, such as FOM/SOM design, system structure, running mechanism of simulation system are discussed.", "authors": ["Chongcheng Chen", "Liyu Tang", "Xiaogang Feng", "Kaihui Lin"], "n_citation": 0, "title": "A distributed forest fire fighting simulation system based on HLA", "venue": "Lecture Notes in Computer Science", "year": 2006, "id": "06a987df-b067-413f-9555-405885651245"}
{"abstract": "Wheeled ground robots are limited from exploring extreme environments such as caves, lava tubes and skylights. Small robots that can utilize unconventional mobility through hopping, flying or rolling can overcome these limitations. Mul-tiple robots operating as a team offer significant benefits over a single large ro-bot, as they are not prone to single-point failure, enable distributed command and control and enable execution of tasks in parallel. These robots can complement large rovers and landers, helping to explore inaccessible sites, obtaining samples and for planning future exploration missions. Our robots, the SphereX, are 3-kg in mass, spherical and contain computers equivalent to current smartphones. They contain an array of guidance, navigation and control sensors and electronics. SphereX contains room for a 1-kg science payload, including for sample return. Our work in this field has recognized the need for miniaturized chemical mobility systems that provide power and propulsion. Our research explored the use of miniature rockets, including solid rockets, bi-propellants including RP1/hydrogen-peroxide and polyurethane/ammonium-perchlorate. These propulsion options provide maximum flight times of 10 minutes on Mars. Flying, especially hovering consumes significant fuel; hence, we have been developing our robots to perform ballistic hops that enable the robots to travel efficiently over long distances. Techniques are being developed to enable mid-course correction during a ballistic hop. Using multiple cameras, it is possible to reconstitute an image scene from motion blur. Hence our approach is to enable photo mapping as the robots travel on a ballistic hop. The same images would also be used for navigation and path planning. Using our proposed design approach, we are developing low-cost methods for surface exploration of planetary bodies using a network of small robots.", "authors": ["Himangshu Kalita", "Ravi Teja Nallapu", "Andrew Warren", "Jekan Thangavelautham"], "n_citation": 0, "references": ["2ac527fa-fc6e-4414-be65-de025e7ee625", "30932642-fd17-4ae9-9a5b-90e67adcfe41", "53971141-d73b-470a-b322-e56b2f9f8714", "5bb2ad40-2470-423f-932e-6ea5f14919c6", "5c509353-74f0-409d-9889-372efb833ec9", "935c5f12-cb46-4e4d-b5e5-6e79169fb5d9", "9ace4e03-15e4-47b3-a2e0-99f32000e19e", "fab7171e-e625-4e69-924a-797d53cca541"], "title": "GNC of the SphereX Robot for Extreme Environment Exploration on Mars", "venue": "arXiv: Robotics", "year": 2017, "id": "071e1103-1b06-4671-8324-a9beb3e90d18"}
{"abstract": "We present a statistical generative model for unsupervised learning of verb argument structures. The model was used to automatically induce the argument structures for the 1,500 most frequent verbs of English. In an evaluation carried out for a representative sample of verbs, more than 90% of the induced argument structures were judged correct by human subjects. The induced structures also overlap significantly with those in PropBank, exhibiting some correct patterns of usage that are not present in this manually developed semantic resource.", "authors": ["Thiago Alexandre Salgueiro Pardo", "Daniel Marcu", "Maria Das Volpe Nunes"], "n_citation": 0, "title": "Unsupervised learning of verb argument structures", "venue": "Lecture Notes in Computer Science", "year": 2006, "id": "0764585b-fec1-4086-9751-643ef3902d52"}
{"abstract": "Fundamental tradeoffs in green cellular networks with coexistence of machine-oriented and human-oriented traffic are investigated. First, we present a queuing system to model the uplink transmission of a green base station which serves two types of distinct traffic with strict requirements on delay and battery lifetime. Then, the energy-lifetime and energy-delay tradeoffs are introduced, and closed-form expressions for energy consumption of the base station, average experienced delay in data transmission, and expected battery lifetime of machine devices are derived. Furthermore, we extend the derived results to the multi-cell scenario, and investigate the impacts of system and traffic parameters on the energy-lifetime and energy-delay tradeoffs using analytical and numerical results. Numerical results show the impact of energy saving for the access network on the introduced tradeoffs, and figure out the ways in which energy could be saved by compromising on the level of performance.", "authors": ["Amin Azari", "Guowang Miao"], "n_citation": 0, "references": ["2eed0e90-d04b-4868-ae90-4dba91794542", "4d302826-cf75-4415-beb7-0b7f69bfe2a6", "75ff8e1a-4f62-4df7-8190-4b68cda69416", "7cdf9036-41b3-496e-a7fe-ca9f7858f6b9", "8c69d90c-4b18-4037-b17d-03c5672c2ed5", "99bb5ecc-47bd-4708-ab7c-5acd79291168", "aba4e267-b349-42f0-8e12-66734e4a0996"], "title": "Battery Lifetime-Aware Base Station Sleeping Control with M2M/H2H Coexistence", "venue": "global communications conference", "year": 2016, "id": "0794014e-c320-4aa7-99f8-bb1d34f86277"}
{"abstract": "In this paper, we present a distributed economic dispatch strategy for a large-scale power system. At first, we treat each generator and load in the grid as an \"agent\". By decomposing the centralized optimization into optimizations at local agents, a scheme is proposed for each agent to iteratively estimate a solution of the optimization problem in a distributed manner. Due to the large number of the agents, the agents are sorted into several clusters and each cluster has a leader to communicate with the leaders of its neighboring clusters. The agents in the same cluster can conduct local optimization and communicate with its neighboring agents in parallel. After that, the leader agents of each cluster exchange their information simultaneously. It is shown that the estimated solutions of all the agents reach consensus of the optimal solution asymptomatically. Compared to our previous work in [14], where the leader agent in each cluster conducts the optimization in a sequential way, the proposed scheme in this paper allows them communicate and conduct optimization simultaneously, which greatly improves the algorithm efficiency. A case study implemented on IEEE 30-bus power system are discussed and tested to validate the proposed method.", "authors": ["Fanghong Guo", "Changyun Wen", "Lantao Xing"], "n_citation": 0, "references": ["15cdd1a5-b2f3-45c7-b6fa-332322aee56d", "2f3b5b57-18f9-4638-af40-be99c7d97f5a", "8e67f4af-bef4-408a-9cc8-65e9b4c407d9", "91b443c2-7d3e-457d-9c0e-a540be3a6aaf", "af9ac400-c5e0-4906-bccb-8ba67d05bc6b", "c2ac8dc5-eeda-4126-8bcd-428530c34502", "fd9ccab5-f1ff-479f-b10d-b974e670675c"], "title": "A distributed algorithm for economic dispatch in a large-scale power system", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "07a98052-2a9d-4787-8eac-0c167cac65be"}
{"abstract": "Massive Multiple-Input-Multiple-Output (M-MIMO) system is a promising technology that offers to mobile networks substantial increase in throughput. In Time-Division Duplexing (TDD), the uplink training allows a Base Station (BS) to acquire Channel State Information (CSI) for both uplink reception and downlink transmission. This is essential for M-MIMO systems where downlink training pilots would consume large portion of the bandwidth. In densely populated areas, pilot symbols are reused among neighboring cells. Pilot contamination is the fundamental bottleneck on the performance of M-MIMO systems. Pilot contamination effect in antenna arrays can be mitigated by treating the channel estimation problem in angular domain where channel sparsity can be exploited. In this paper, we introduce a codebook that projects the channel into orthogonal beams and apply Minimum Mean-Squared Error (MMSE) criterion to estimate the channel. We also propose data-aided channel covariance matrix estimation algorithm for angular domain MMSE channel estimator by exploiting properties of linear antenna array. The algorithm is based on simple linear operations and no matrix inversion is involved. Numerical results show that the algorithm performs well in mitigating pilot contamination where the desired channel and other interfering channels span overlapping angle-of-arrivals.", "authors": ["Yihenew Dagne Beyene", "Kalle Ruttik", "Riku Jäntti"], "n_citation": 0, "references": ["397d220e-8154-4729-b2e4-10af297c6da4", "99d4c119-b99d-4931-a343-dc048cd562ca", "a4f35f32-3bec-43f9-9570-81f6d8aedfeb", "ad93a8cf-7157-4e38-8028-6acf2850e67a"], "title": "Angular Domain Data-Assisted Channel Estimation for Pilot Decontamination in Massive MIMO", "venue": "Mobile Information Systems", "year": 2017, "id": "08005b30-d0de-4578-84a3-dafa9b34c787"}
{"authors": ["Dalė Dzemydienė", "Saulius Maskeliūnas", "Giedrė Dzemydaitė", "Arūnas Miliauskas"], "n_citation": 0, "title": "Semi-Automatic Service Provision Based on Interaction of Data Warehouses for Evaluation of Water Resources", "venue": "Informatica (lithuanian Academy of Sciences)", "year": 2016, "id": "0820fe4c-099f-41ba-8b8c-9d633cbd783c"}
{"abstract": "This paper introduces a performance evaluation method for algorithms that generates a depth map using an image from a stereo endoscopic camera for image processing of laparoscope operations. The depth image was created by using a space-time stereo method by illuminating various patterns on scenes consisting of models of the 3D-printed organ model and actual organs from a pig, and the ground truth image was generated for each sub-pixel unit to achieve high accuracy and high precision. Different algorithms were evaluated using the ground truth image data. The number of effective depth pixels compared to the ground truth and the distance error was measured from algorithms based on an edge-preserving filter as real-time algorithms and quasi-dense algorithms. This paper presents an analysis of each algorithm from its evaluation indices to determine which algorithm is appropriate to compute the depth map from laparoscopic images.", "authors": ["Jiho Chang", "Jae-chan Jeong", "Ho-chul Shin"], "n_citation": 0, "references": ["1f520d1a-5870-477d-85d7-0f50be690ea7", "3685b3bf-1b66-4cbf-ae23-3ade0eabd832", "555ad45d-a882-4a07-a5a6-41ddb65d3fc8", "b0b1fe69-89a7-4d70-ad62-15ddcbd767c2", "b1357d01-99b5-4abd-8fbb-6fc478b7b4a4", "db848f26-fa82-4824-bb6e-825c4fee6437"], "title": "Performance evaluation of depth map generation algorithm for stereo endoscopic camera", "venue": "", "year": 2016, "id": "08bec57f-c415-4614-b49d-a01db2f9e84a"}
{"abstract": "This paper addresses the synchronization and state estimation problems for an array of coupled discrete-time stochastic complex networks (SCNs) with uncertain inner couplings in which time-varying delay is considered both in the network couplings and dynamical nodes. In particular, the uncertainties encountering in coupling terms are characterized by using the interval matrix approach. By constructing a suitable Lyapunov–Krasovskii functional and utilizing Kronecker product properties, a new set of sufficient conditions is established in terms of linear matrix inequalities to guarantee the synchronization of the addressed SCNs with a prescribed mixed  H  ∞  and passivity performance index. Moreover, the state estimation problem is then studied for the same SCNs with uncertain inner coupling strength and subsequently, the estimator is designed. More precisely, Schur complement, discrete-time Jensen’s inequality together with reciprocally convex combination approach are used to simplify the derivations in the main results. Finally, numerical examples are exploited to illustrate the effectiveness of the proposed synchronization and state estimation results.", "authors": ["R. Sakthivel", "M. Sathishkumar", "B. Kaviarasan", "S. Marshal Anthoni"], "n_citation": 50, "references": ["13a1ecb2-e3c6-40f0-b7a7-a1fe8390e0a3", "1454d5fa-84de-4e14-9c6e-23f61edfa1d9", "20f9b218-a4c7-4878-bdf2-3d52bb353601", "2bbe830e-a318-4fdc-9292-4d85738db32c", "37626e69-e0b2-4cf4-a309-86ac416dcd9b", "6c8bb875-2f98-47ce-a705-9a5bd852caa4", "787e74c3-d94e-4929-b501-9ed9fd1b6f6f", "7b2c56da-ca0b-4951-9069-129b7792b62b", "82e47334-1059-4a9e-a7b5-e7bcfd322dc4", "9554cc4d-4d60-474b-a391-9ebcf63fa0c0", "b744d133-6e6e-4400-afed-a425975fa49b", "be056407-55df-4e8f-9941-98216ac8cd25", "cc7bcdc5-d631-498b-955e-f2d4683b4a61", "e80bbbe8-829f-4ad1-ac81-dd1e913eba8c"], "title": "Synchronization and state estimation for stochastic complex networks with uncertain inner coupling", "venue": "Neurocomputing", "year": 2017, "id": "08ed3a9e-75a9-4f91-b318-c24cf56eb6e7"}
{"abstract": "Branch and bound is a well-known generic method for computing an optimal solution of a single-objective optimization problem. Based on the idea “divide to conquer”, it consists in an implicit enumeration principle viewed as a tree search. Although the branch and bound was first suggested by Land and Doig (1960), the first complete algorithm introduced as a multi-objective branch and bound that we identified was proposed by Kiziltan and Yucaoglu (1983). Rather few multi-objective branch and bound algorithms have been proposed. This situation is not surprising as the contributions on the extensions of the components of branch and bound for multi-objective optimization are recent. For example, the concept of bound sets, which extends the classic notion of bounds, has been mentioned by Villarreal and Karwan (1981). But it was only developed for the first time in 2001 by Ehrgott and Gandibleux, and fully defined in 2007.#R##N##R##N#This paper describes a state-of-the-art of multi-objective branch and bound, which reviews concepts, components and published algorithms. It mainly focuses on the contributions belonging to the class of optimization problems who has received the most of attention in this context from 1983 until 2015: the linear optimization problems with zero-one variables and mixed 0–1/continuous variables. Only papers aiming to compute a complete set of efficient solutions are discussed.", "authors": ["Anthony Przybylski", "Xavier Gandibleux"], "n_citation": 0, "references": ["003b2880-b83c-44bf-bee1-7ebfe5efb498", "01d9e9da-3620-4b9a-ab71-76863356f115", "05607e8c-4518-47f4-a1f4-008b54f042e5", "0a75eddd-3a89-4ddc-adb9-32d3aa7f8b75", "0dd3aa6c-e22a-4757-a2aa-fabd23d36122", "1255b075-5b88-4895-90c1-eff2e058a104", "2181e319-f2d3-4117-b34f-3ea8957456b9", "24099c98-dae2-4404-a179-4092389037cb", "2f138454-874f-4cee-ae9f-b4329d14a5cb", "2f5fb9e2-94c4-4ba2-92d9-1c157ac7f98b", "3319b470-e3db-45f8-a067-824b0a6c308c", "5183a1dd-e591-4b22-985e-f5afe3387ca8", "602db22b-43ea-403c-81c7-514dffe0c1d6", "62acba83-9873-469d-96e5-5115cb8655d3", "6603ea38-9912-4b0f-8b25-0004f4229a23", "66eed1ac-0868-499c-b03c-f5ea17fe8eb6", "8007f0be-098f-489a-904b-87654998e137", "84c0f524-644c-4eaf-a130-59af33868c80", "8c307463-9eae-43df-ae00-8a416aa26dbc", "9c40f7c7-752e-476c-acc1-2f0a0ccb3b46", "b3da1ad1-6b7c-47e8-b804-e98b74c78b03", "b7cd90c7-7eba-4b87-a9d9-d1f21ad96aa6", "bb1945f6-6e79-4e44-9ffa-15e709b7382d", "c06710ea-4061-4dc4-913f-130db1ea8f2a", "c50336e1-6fd9-4182-a747-6b686bbf4bb2", "c771b0d7-ae7a-4429-8ddc-48db730634e1", "c80550f5-5801-48b1-a6e3-161bf584b145", "e3178375-38b3-43c9-95b9-322f4a9ec01f", "f07ffef1-d0fa-4c85-87cf-8c74f5c30941", "f7d1c4ea-71e2-47ff-af13-e4e14ce7e0b6"], "title": "Multi-objective branch and bound", "venue": "European Journal of Operational Research", "year": 2017, "id": "093e387e-9041-420d-8ed6-612e7bc6e916"}
{"abstract": "Self-reconfigurable modular robots (SRMRs) have recently attracted considerable attention because of their numerous potential applications in the real world. In this paper, we draw a comprehensive comparison among five different algorithms in path planning of a novel SRMR system called ACMoD through an environment comprised of various terrains in a static condition. The contribution of this work is that the reconfiguration ability of ACMoD has been taken into account. This consideration, though raises new algorithmic challenges, equips the robot with new capability to pass difficult terrains rather than bypassing them, and consequently the robot can achieve better performance in terms of traversal time and energy consumption. In this work, four different optimization algorithms, including Adaptive Genetic Algorithm, Elitist Ant System, Dijkstra and Dynamic Weighting A*, along with a well-known reinforcement learning algorithm called Q-Learning, are proposed to solve this path planning problem. The outputs of these algorithms are the optimal path through the environment and the associated configuration on each segment of the path. The challenges involved in mapping the path planning problem to each algorithm are discussed in full details. Eventually, all algorithms are compared in terms of the quality of their solutions and convergence rate.", "authors": ["Sajad Haghzad Klidbary", "Saeed Bagheri Shouraki", "Soroush Sheikhpour Kourabbaslou"], "n_citation": 0, "references": ["070f917c-d01e-435f-9466-bf8eaa002def", "288106a6-f48d-44c2-98fb-bd4c257d6ff5", "293971a9-15e0-4a32-9c76-8a9704e304c2", "30932642-fd17-4ae9-9a5b-90e67adcfe41", "388470d9-49db-42ce-97c8-f863fcc5f989", "42a65ef2-922f-44d4-b8a7-963b3a35b4cf", "5d491211-2de2-4b7a-8f9a-94b718e51e0d", "64166868-cc56-4d33-aba9-1168b22131a1", "76eddd5c-8eab-49e5-8925-b526bc9d2c65", "7cd8c97b-ae4f-45e2-b87f-5e2a5f4b1c6d", "842dc017-aaf8-45e5-9dc3-62cf2dedcc7f", "8a70ef11-bd1a-4de7-87c8-4b40831b70d7", "99c52db0-e715-49a6-bf57-9b18aeb2240c", "9a2ad1c6-9e8e-4b4d-8143-303ab5b52970", "a0beec2b-ec67-4a11-b778-c6a0146c05d0", "b08b7edd-e1d0-4662-844e-2b68c4554730", "b50f8b0f-53d9-4883-a00c-53dd85ecafbf", "bd5ca86e-a109-4943-900d-ef51205292bf", "c18519d5-7c06-4328-b720-b9865e1874a1", "cd544da7-c66a-4369-ad4b-d0bb0e386ab1", "cfa66079-4432-46e3-bf49-8c7275236f4f", "d162ceec-58d3-43a2-b3e7-712ce57fa684", "d1b9e902-d3a5-4914-b1c2-2e7351d81205", "e0f3a738-4ab2-40d1-ba44-506d81c1d230", "ef951512-07f8-4ff4-8716-65e4e087c784", "f2ac32ce-68c4-4e57-b7ec-2ff91e46bc24", "fdfa51dd-5732-4297-aeba-9991aa9bd2c7"], "title": "Path planning of modular robots on various terrains using Q-learning versus optimization algorithms", "venue": "Intelligent Service Robotics", "year": 2017, "id": "0977ddfd-d01a-46cd-93e4-a101757dd1e0"}
{"authors": ["Fabrizio Dabbene"], "n_citation": 0, "title": "Optimal control, an introduction: Arturo Locatelli, Birkhäuser, London, Basel, 2000, ISBN 3-7643-6408-4.", "venue": "Automatica", "year": 2004, "id": "09a53601-06e4-4f7e-bf98-06ed1ae0b35e"}
{"abstract": "In mobile robotic applications, a common problem is the following of a given trajectory with a constant velocity. Using standard model predictive control (MPC) for tracking of time varying trajectories leads to a constant tracking error. This problem is modelled in this paper as quadrotor position tracking problem. The presented solution is a computationally light-weight target position control (TPC), that controls the tracking error of MPCs for constantly moving targets. The proposed technique is assessed mathematically in the Laplace domain, in simulation, as well as experimentally on a real quadrotor system.", "authors": ["Jan Eric Dentler", "Somasundar Kannan", "Miguel Angel Olivares Mendez", "Holger Voos"], "n_citation": 0, "references": ["02e5b03a-5388-4faf-ab4e-b3523ad39081", "09d5c2b5-78bc-4381-a157-f80c69312f05", "17ff45ca-2373-4d3b-b487-a975d02cfbf9", "45cb1359-df7f-40bf-b698-98d1f0e2d7f4", "c2497cff-5b9f-4a9f-937d-20f92c2fef09"], "title": "A tracking error control approach for model predictive position control of a quadrotor with time varying reference", "venue": "robotics and biomimetics", "year": 2016, "id": "09e659aa-7446-43f4-bc1b-576d601aa402"}
{"abstract": "Prioritization of new requirements to implement in software is a key point for maintenance and preservation of quality, observing business rules and standards of the company. The tools for prioritization, based on probed and recognized techniques require pre-qualify each requirement. If the company has several requests from customers of a product, increase the factors that affect it. The tools do not include these aspects of the complex task of qualifying. This research started with a survey of the methods of prioritization and selection of new requirements used by software development companies in the area of Rosario; and culminated with the definition of a methodology for prioritization of new requirements. These involves the analysis and evaluation of all the factors and consequences of implementing the selected requirements in the software product. The methodology includes the financial criteria and business rules of the company, and other quality values defined by its managers.", "authors": ["Sara De Federico", "Silvio Gonnet"], "n_citation": 0, "title": "New requirements prioritization based on customer historical profiles", "venue": "", "year": 2016, "id": "09faae8b-699a-45d6-b6a2-02d7c3f4fbad"}
{"abstract": "We are delighted to present the 2016 11 th  International Design and Test Symposium (IDT) which is organized this year in Hammamet city, Tunisia, December, 18–20, 2016.", "authors": ["Mohamed Abid", "Yervant Zorian"], "n_citation": 0, "title": "Welcome to the IDT 2016", "venue": "Intelligent Decision Technologies", "year": 2016, "id": "0a06cb96-5255-486e-9e4b-3059b04e3aa2"}
{"abstract": "While hardware transactional memory (HTM) has recently been adopted to construct efficient concurrent search tree structures, such designs fail to deliver scalable performance under contention. In this paper, we first conduct a detailed analysis on an HTM-based concurrent B+Tree, which uncovers several reasons for excessive HTM aborts induced by both false and true conflicts under contention. Based on the analysis, we advocate Eunomia, a design pattern for search trees which contains several principles to reduce HTM aborts, including splitting HTM regions with version-based concurrency control to reduce HTM working sets, partitioned data layout to reduce false conflicts, proactively detecting and avoiding true conflicts, and adaptive concurrency control. To validate their effectiveness, we apply such designs to construct a scalable concurrent B+Tree using HTM. Evaluation using key-value store benchmarks on a 20-core HTM-capable multi-core machine shows that Eunomia leads to 5X-11X speedup under high contention, while incurring small overhead under low contention.", "authors": ["Xin Wang", "Weihua Zhang", "Zhaoguo Wang", "Ziyun Wei", "Haibo Chen", "Wenyun Zhao"], "n_citation": 0, "references": ["0131c113-559f-42da-94e3-f5fc60ddb16e", "014e3b46-0c40-4d59-afe3-602b7e08ed22", "0f065892-4430-4628-b5c6-aec574869be1", "16e9c2b2-5978-41d1-86f0-3f91ea2095fe", "20c1a651-ec20-44cc-bd6d-b5982a0f3e55", "234cc65d-a11c-40c3-b61e-1d4697c69e61", "2a25de10-ea33-410c-8f32-69feae4030ab", "3028bf0f-26d5-4275-9f03-038683080f39", "3c9affe5-a987-43bd-89a9-68eb9762659b", "4799a163-054c-4575-85fe-2a513b0cbfc9", "482b77a6-2d75-419b-9805-5dfc1e5b6e10", "495bc3eb-10d7-4e1a-96c1-8c247b3d6e74", "590d20e9-d235-4939-b1c8-b8ccc345d45b", "6158ba15-c196-4163-a899-872f1ce0e9fc", "646ddcd4-0547-427b-9451-f84400bd18b2", "690e99b1-52db-44cd-b6ce-38008d4dc761", "699fd50e-7da0-4d25-a3e2-1ec6275d630f", "6e6f92d1-ae41-4680-b9fb-ed284d7f3ca0", "85e460ac-801d-465d-b71d-145de98060cf", "86994343-85ab-4a6e-9636-0a485ed49af7", "8f662192-4b14-47e6-bcf1-24d6ea9703f6", "984f547c-d135-4cf8-b85e-7315f571b4aa", "99ecce31-28e7-4d23-aa5b-23b72db095ac", "9b23dcb1-20f3-419e-bae4-56c5b73bf27f", "bea81637-19be-47c8-a328-1484dbc7a033", "c177b850-1275-4b3b-953d-5d7791bfea5b", "cc76cc26-3128-44a3-8c50-d692b9031790"], "title": "Eunomia: Scaling Concurrent Search Trees under Contention Using HTM", "venue": "acm sigplan symposium on principles and practice of parallel programming", "year": 2017, "id": "0a070f4c-5077-4610-adb8-6be5538617c5"}
{"abstract": "Antenna switch enables multiple antennas to share a common RF chain, thus an additional spatial dimension, i.e., antenna index, can be utilized in the design of single RF chain MIMO and information can be conveyed via both signal space and spatial dimension. In this paper, we propose a unified adaptive transmission scheme - adaptive spatial modulation that allocates information into signal space and spatial dimension in order to maximize the overall channel capacity for single RF chain MIMO. The proposed adaptive spatial modulation is realized by using Huffman coding, i.e., designing variable length codes to activate the transmit antenna with different probabilities. The optimal antenna activation probability is derived through optimizing channel capacity. To make the optimization tractable, closed form upper bound and lower bound are derived as the effective approximations for channel capacity. Numerical results show that the proposed adaptive spatial modulation offers considerable performance improvement over both spatial modulation and transmit antenna selection.", "authors": ["Wei Wang", "Wei Zhang"], "n_citation": 0, "references": ["19392837-7972-4aa7-a860-d6c90458f7b8", "4f48b371-d692-4a79-ad46-a9159dfdd672", "748a2ab3-8b5f-4d0a-9e2d-af685089843a", "870d11c0-8636-4f9a-b265-1016474bebff", "b4022bac-a157-4a3a-9cab-050b7c5a49c3", "c9c5a9c0-f1b7-4286-8538-13476ae32e60"], "title": "Adaptive Spatial Modulation Using Huffman Coding", "venue": "global communications conference", "year": 2016, "id": "0a13520f-b058-43ff-ad3b-5e292422887e"}
{"abstract": "Semantic image segmentation is a fundamental task in image understanding. Per-pixel semantic labelling of an image benefits greatly from the ability to consider region consistency both locally and globally. However, many Fully Convolutional Network based methods do not impose such consistency, which may give rise to noisy and implausible predictions. We address this issue by proposing a dense multi-label network module that is able to encourage the region consistency at different levels. This simple but effective module can be easily integrated into any semantic segmentation systems. With comprehensive experiments, we show that the dense multi-label can successfully remove the implausible labels and clear the confusion so as to boost the performance of semantic segmentation systems.", "authors": ["Tong Shen", "Guosheng Lin", "Chunhua Shen", "Ian D. Reid 0001"], "n_citation": 50, "references": ["031bbeb0-4dc1-46f9-9984-109c3b3eefae", "153c5014-dc7a-44a8-a93f-5cd27f1193df", "176a7436-78ea-4c2a-82e6-7930ab023bd1", "19d46c45-9aae-4fb4-8faa-1c4aab897468", "1ee6c6af-f18f-4b88-8d66-db763bc6f864", "23cddb94-a0fd-4711-b5c7-3c12e44545fe", "28d47fcd-4f94-4de9-b57b-99ba4545b867", "42efaf01-c82e-4d9f-a09a-bcc7a89e9593", "5e5f0f16-9885-46cb-9c54-8c92803f3874", "62de2ab7-adfd-4b2f-b7c9-3d91ebb1f0ee", "7091292e-20a5-44ae-bd53-b423c30f08cb", "72640ec0-e5e8-4b68-9508-f8a7edfcc343", "7d479bda-f8ab-4c55-8a7a-fd44b439e9e3", "83c737b8-e084-4766-ba6e-131e6a1c017c", "95c111f4-55d0-455e-884a-4485ff03b494", "ec26a04b-fff3-41c3-a52b-cebdaca61243", "f96b05ce-e0b1-4c26-929e-1fe675c4b4e3"], "title": "Learning Multi-level Region Consistency with Dense Multi-label Networks for Semantic Segmentation", "venue": "arXiv: Computer Vision and Pattern Recognition", "year": 2017, "id": "0a2562d0-f2af-47e1-a783-02aac8607c7b"}
{"abstract": "This paper focuses on modeling ride requests and their variations over location and time, based on analyzing extensive real-world data from a ride-sharing service. We introduce a graph model that captures the spatial and temporal variability of ride requests and the potentials for ride pooling. We discover these ride request graphs exhibit a well known property called densification power law often found in real graphs modelling human behaviors. We show the pattern of ride requests and the potential of ride pooling for a city can be characterized by the densification factor of the ride request graphs. Previous works have shown that it is possible to automatically generate synthetic versions of these graphs that exhibit a given densification factor. We present an algorithm for automatic generation of synthetic ride request graphs that match quite well the densification factor of ride request graphs from actual ride request data.", "authors": ["Abhinav Jauhri", "Brian Foo", "Jerome Berclaz", "Chih Chi Hu", "Radek Grzeszczuk", "Vasu Parameswaran", "John Paul Shen"], "n_citation": 0, "references": ["1079e0ff-5b82-466a-8a4d-888070e0fbd2", "24861225-3105-4832-addb-a546909650b0", "58600378-8e31-4103-8feb-69f2d3f97606", "68faab18-b537-4f62-85cf-ddc9ef352362", "713ca1b9-71b6-48e9-bcf3-156b6dcae8f4", "e7f6b8b1-4fdc-48df-876f-67859ed4d5cf", "f75e49b7-bd64-41a1-bba4-b744c67ba062"], "title": "Space-Time Graph Modeling of Ride Requests Based on Real-World Data", "venue": "arXiv: Artificial Intelligence", "year": 2017, "id": "0a94673d-9653-4c2a-bfee-e7f7bd41cb46"}
{"abstract": "In this work, we address the low-complexity construction of shortened and punctured polar codes from a unified view. While several independent puncturing and shortening designs were attempted in the literature, our goal is a unique, low-complexity construction encompassing both techniques in order to achieve any code length and rate. We observe that our solution significantly reduces the construction complexity as compared to state-of-the-art solutions while providing a block error rate performance comparable to constructions that are highly optimized for specific lengths and rates. This makes the constructed polar codes highly suitable for practical application in future communication systems requiring a large set of polar codes with different lengths and rates.", "authors": ["Valerio Bioglio", "Frederic Gabry", "Ingmar Land"], "n_citation": 0, "references": ["063aa38b-815f-420d-a1d5-c3b8077d35d1", "0a212991-fd54-4e5e-a5be-39e89a5d1a9f", "1c1956a8-7c88-494f-ab0b-b957848671dd", "74c3a1c3-902c-4eda-a7a5-f9407a36cdfd", "82af5ba0-738f-48bb-9dba-0b59dc51f403", "87287098-3723-49be-b605-15d22b3fda43", "8a63e93f-6382-4f27-8f1d-65b46e688945", "a99b8dbf-eadf-47b1-b0ef-aab14556e80b", "b74034d6-c5ca-4c6c-b96b-3cb3d6769602", "fba0133c-8d49-44c4-acd1-b59fc5f02426"], "title": "Low-Complexity Puncturing and Shortening of Polar Codes", "venue": "wireless communications and networking conference", "year": 2017, "id": "0aa44d12-30f7-450e-bc29-28a8799ee804"}
{"authors": ["Kat Agres", "Stephen McGregor", "Karolina Rataj", "Matthew Purver", "Geraint A. Wiggins"], "n_citation": 50, "title": "Modeling metaphor perception with distributional semantics vector space models.", "venue": "", "year": 2016, "id": "0aca9da2-99d9-4349-8d7e-ed02103f728a"}
{"authors": ["K. R. Jayaram", "Aleksandar Milenkoski", "Samuel Kounev"], "n_citation": 0, "references": ["3184d624-b3b4-4ac3-9230-4f1ac122f3fd", "49853b10-b217-4d19-9a9b-61244ce873ba", "52def73e-c3d8-4419-af73-de1601388aa3", "e428d749-c2f1-41da-a00e-ef44850bf4c3"], "title": "Software Architectures for Self-protection in IaaS Clouds", "venue": "", "year": 2017, "id": "0b19e3e2-6a3a-4427-b00e-03e3c14c0e96"}
{"abstract": "Radar technology is used for many applications of advanced driver assistance systems (ADASs) and is considered as one of the key technologies for highly automated driving (HAD). An overview of conventional automotive radar processing is presented and critical use cases are pointed out in which conventional processing is bound to fail due to limited frequency resolution. Consequently, a flexible framework for computationally efficient high-resolution frequency estimation is presented. This framework is based on decoupled frequency estimation in the Fourier domain, where high-resolution processing can be applied to either the range, relative velocity, or angular dimension. Real data obtained from series-production automotive radar sensor are presented to show the effectiveness of the presented approach.", "authors": ["Florian Engels", "Philipp Heidenreich", "Abdelhak M. Zoubir", "Friedrich K. Jondral", "Markus Wintermantel"], "n_citation": 0, "references": ["644017f5-5562-46d1-ac8d-ed6127e0cf5f", "7f2658e0-3392-4df6-af09-732f501cf5be", "878f0093-675a-4aa8-928d-6d053dbea592", "8dd428d1-201e-4b26-8473-ae5470b3c19c", "96a6e273-0c66-49e9-8716-c951823ed208", "9cf05d04-12eb-4109-a1b6-4e06a2519144", "a1e81cdb-033a-43bc-9920-0e279ef44f56", "b3cf97ae-3ccc-4d6f-9722-00899afd5a49", "c5a90983-ccd7-4cb9-9c17-9d1bd157097a", "cc9562a6-cb23-47e2-80de-669e9966eff9", "cee46718-dff1-4424-ae15-5018e90e7597", "d599e372-9891-4e7c-90cd-c1e8e51e771d", "d802af15-51a0-48e0-8839-aa17298de620", "deee8ed7-e261-47aa-823f-6b9b194f91be", "e597ec43-ff7b-4beb-a967-fdd027ce307a"], "title": "Advances in Automotive Radar: A framework on computationally efficient high-resolution frequency estimation", "venue": "IEEE Signal Processing Magazine", "year": 2017, "id": "0b32a5d2-c71c-4573-ba77-590c1fd2f40a"}
{"abstract": "This paper investigates a new analog beamforming architecture for massive multiple-input multiple-output (MIMO) systems, where each of the multiple transmit antennas is switched to be on or off to form a beam according to the channel state information at transmitters. This on-off analog beamforming (OABF) scheme has the advantages in terms of both hardware complexities and algorithmic complexities. OABF can completely remove the high-cost, power-consuming and bulky analog phase-shifters that are extensively employed by traditional analog beamforming schemes; it only requires the deployment of low-cost analog switches that are easy to implement. Moreover, we show that the beams formed by such simple antenna on-off switch operations can achieve rather good performances with low-complexity beamforming algorithms. Specifically, we first propose two optimal signal-to-noise ratio maximization algorithms to determine the on-off state of each switch under the per-antenna power constraint and the total power constraint, respectively. After that, we theoretically prove that OABF can achieve the full diversity gain and the full array gain with complexities up to a polynomial order. Numerical results are consistent with our theoretical analysis. We believe that the simple structure of OABF makes massive MIMO much easier to implement in real systems.", "authors": ["Shengli Zhang", "Chongtao Guo", "Taotao Wang", "Wei Zhang"], "n_citation": 0, "references": ["13325197-396a-4b84-9ee4-f3a193af131d", "147cc7ee-cf84-4cf9-b2a0-ab2da2912ac8", "1b934bda-fb88-4f6d-8032-160bdeb680ff", "1c51be67-2491-4df6-95e1-c9403b173a6b", "1edb2abc-4a7e-4578-849b-b055cd65f21f", "277c3c6a-d523-4943-b4d1-93dae21252a1", "369c3d88-a460-49e5-9900-f3df356350e6", "4f1448d5-3f22-4ad2-b0c4-1cb66ddea741", "5db1f8dd-aeb0-42fd-8ce1-d86ccfe51332", "6b4920a9-9dbd-411e-9618-0dd545bc97d7", "6b96ace2-e362-4610-941c-37b19dc90b61", "6de05dcb-2e39-46d2-bf91-d7bd8f59ca21", "8d9b92a6-65ba-41bc-8525-2671ef222ad5", "96c5991e-38e8-4e72-a8e8-cec692040cca", "99d4c119-b99d-4931-a343-dc048cd562ca", "a686f64c-5d93-4644-9594-c4f02168179e", "aac78168-869e-4d80-950e-5c08e9f66e2e", "ab59fc80-35fc-4ed5-a12c-3f0a6f69eadd", "ae7acb26-9841-4ca8-89bd-868192245a35", "d2b797a2-ddbf-4e65-b545-ceb09b4a6d1e", "d863de8c-c7e1-4a4e-9f6b-59b21a10c5e6", "ddc5fdfa-2ad9-4801-ae5f-b778ec5fa5f4", "e769e232-fb20-4da9-a77a-4bf916c5f756", "f17f15fa-73b2-42d9-a95f-59e5fa95918b"], "title": "On-off Analog Beamforming for Massive MIMO", "venue": "arXiv: Information Theory", "year": 2017, "id": "0b65cc36-16e3-4c8b-9e86-c49cb982e4bf"}
{"abstract": "Structured regression has been successfully used in many applications where explanatory and response variables are inter-correlated, such as in weighted attributed networks. One of structured models, Gaussian Conditional Random Fields (GCRF), utilizing multiple unstructured models to learn the non-linear relationships between node attributes and the structured response variable, achieves high prediction accuracy. However, it does not scale well with large networks. We propose a novel model, called Scalable Approximate GCRF (SA-GCRF), which integrates weighted attributed network compression with GCRF, with the aim of making GCRF applicable to large networks. The model consists of three steps: first, it compresses a network into a smaller one by generalizing nodes into supernodes and edges into superedges; then, it applies GCRF to the reduced network; and finally, it unfolds the predicted response variables into the original nodes. Our hypothesis is that the reduced network maintains most information of the original network such that the loss in prediction accuracy obtained by GCRF on the reduced network is minor. The comprehensive experimental results indicate that SA-GCRF was 150–520 times faster than standard GCRF and 11–29 times faster than state-of-the-art UmGCRF on large networks, and provided regression results where GCRF and UmGCRF were not applicable. Furthermore, SA-GCRF achieved a similar regression accuracy, 0.76, to the one obtained from the original real-world weighted attributed citation network, even after compressing the network to 10% of its size.", "authors": ["Fang Zhou", "Mohamed F. Ghalwash", "Zoran Obradovic"], "n_citation": 1, "references": ["05747537-ec32-4428-bb6a-adc8613e17c3", "05dc4e28-cbb9-4c68-8d30-9143bd80853c", "2b78227d-7cc3-4e64-bedd-195272ba6348", "2c066e28-3565-481b-822a-e13830532f82", "334653df-2fdd-4f99-8061-39525f42d0ba", "414b660e-0e16-4e22-91e9-aa4e54765bc7", "449d9dc9-32df-49ac-9caf-9c904d06dd2a", "6379797c-3b21-4608-8b0a-d76db3869592", "6415d03e-6198-44d4-9ca7-4308cab5ba7f", "6ba6fffd-c329-4cdb-b6b4-feeec99901cf", "72c0be6b-b51a-4aec-9806-a652e6629b3d", "7fea8db4-18fa-4a92-8a62-8be0fb745907", "ae829318-5d10-461d-9c99-34a95a3f8732", "b323560a-8927-4ddc-be9a-7bfc48625ea7", "c0473d19-6897-410b-8b7a-0af42d31cb68", "d5c5aa7f-63ef-48a8-920e-7200b1264a8f", "d6da9732-c3fc-409b-8d67-291ca3577ff4", "dc673d4f-8bbe-426f-8ff0-8ba88bf260c7", "dd33e666-8572-492f-a2cf-0d42495e5f3a", "f5d9a67a-3768-4a4e-bfab-5d9d21e82d1c"], "title": "A fast structured regression for large networks", "venue": "", "year": 2016, "id": "0b6b0cc7-4397-480e-9ec6-5cac94c2aa11"}
{"abstract": "Successful transfer and sharing of knowledge rely mainly on social attitudes, behaviours and networks, rather than ICT-based networks. The availability of Information and Communication Technologies (ICTs) facilitates the management of projects in general. ICTs are central to both managing Information Literacy projects and providing access to learning resources and opportunities for collaborative learning. In this paper, we propose a framework for quality management of information literacy projects. Learning from the field of Information Systems Quality Management the proposed framework encompasses Deming's PDCA (Plan, Do, Check, Act) Cycle and Kitchenham's Process Improvement model. From the Information Literacy field the SCONUL model provide the dimension of standardisation. The framework is customisable to prioritise aspects based on the likelihood, proximity and impact of risks. The success of Information Literacy programmes and projects depends on the availability and use of ICTs and in this paper we argue how the Information Literacy Project success can be enhanced by using our framework.", "authors": ["Elli Georgiadou", "Claire McGuinness", "Kerstin V. Siakas", "Manolis Koukourakis", "Angela Repanovici", "Nawaz Khan", "Harjinder Rahanu"], "n_citation": 0, "references": ["15b72552-a84d-4c16-92f7-fcaa0bb8d88a", "3bd4cb6c-d953-4853-9e88-9cea8de07680", "44067728-6c12-4a93-bb2e-07143c92832e", "b592099d-6269-4c41-b4aa-14a16ff4938b", "b5fdaf37-f9be-44d2-a0fa-2d75937db021", "cb1d5623-fb23-436a-96cf-9433a1726df9"], "title": "The QUAIL Framework: Quality Assurance for Information Literacy Projects", "venue": "International Journal of Human Capital and Information Technology Professionals", "year": 2017, "id": "0b7aa060-0b27-45d2-a9b4-35e611bedcde"}
{"abstract": "It is becoming increasingly achievable for steel bridge structures, which are normally both inaccessible and hazardous for humans, to be inspected and maintained by autonomous robots. Steel bridges have been traditionally constructed by securing plate members together with rivets. However, rivets present a challenge for robots both in terms of cleaning and surface traversal. This paper presents a novel approach to RGB-D image and point cloud analysis that enables rivets to be rapidly and robustly located using low cost, non-contact sensing devices that can be easily affixed to a robot. The approach performs classification based on: (a) high-intensity blobs in color images, (b) the non-linear perturbations in depth images, and (c) surface normal clusters in 3D point clouds. The predicted rivet locations from the three classifiers are combined using a probabilistic occupancy mapping technique. Experiments are conducted in several different lab and real-world steel bridge environments, where there is no external lighting infrastructure, and the sensors are attached to a mobile platform, i.e. a climbing inspection robot. The location of rivets within 2m of the robot can be robustly located within 10mm of their correct location. The state of voxels can be predicted with above 95% accuracy, in approximately 1 second per frame.", "authors": ["Gavin Paul", "LiYang Liu", "Dikai Liu"], "n_citation": 0, "references": ["47fac844-74f0-4da1-b5cd-642ff32d3800", "499198cd-e10d-4908-9eaf-2ce1c8eac3ea", "69b7bc89-2de1-4b91-ad48-f5f6220449b5", "7faabcc0-9fc1-4c5f-8fb4-72980239b470", "bd17f9ba-4222-4cb6-91c0-2df0503a4aab", "c5ef8b81-11b9-413d-b502-507f0cf2a7dc", "ebfca554-7a3c-4597-954b-07336a2e3030", "f24b87a0-7532-4dc7-ae4b-f7bee6e55d0a"], "title": "A novel approach to steel rivet detection in poorly illuminated steel structural environments", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "0b9dd80d-0e27-4eb7-874e-4649b7e69e00"}
{"authors": ["Michael R. Anderson"], "n_citation": 0, "references": ["7a192238-d608-4c76-a7b2-2557466121c5", "db6706ab-b50e-4d76-8f9e-17bbcba9cbc2", "e06fa649-332d-4275-a96f-cdeb6bf8e139"], "title": "Faster Evaluation of Labor-Intensive Features.", "venue": "conference on innovative data systems research", "year": 2015, "id": "0bfc6df5-b2b2-4213-87cd-5e0ef3cf477f"}
{"abstract": "A fundamental problem in a pure Peer-to-Peer (P2P) file sharing system is how to protect the anonymity of nodes when providing efficient data access services. By seamlessly combining the technologies of multi-proxy and IP multicast together, we propose a multicast-based protocol for efficient file sharing with mutual anonymity in this paper. Furthermore, the proposed protocol can adaptively adjust file distribution and reduce the multicast cost simultaneously. The simulations show that Mapper possesses the merits of scalability, reliability, and high adaptability with high performance.", "authors": ["Baoliu Ye", "Jingyang Zhou", "Yang Zhang", "Jiannong Cao", "Daoxu Chen"], "n_citation": 0, "title": "An efficient protocol for Peer-to-Peer file sharing with mutual anonymity", "venue": "Lecture Notes in Computer Science", "year": 2004, "id": "0c54ebf7-02e0-4099-b018-5777f08d1708"}
{"abstract": "Multilinear systems of equations arise in various applications, such as numerical partial differential equations, data mining, and tensor complementarity problems. In this paper, we propose a homotopy method for finding the unique positive solution to a multilinear system with a nonsingular M-tensor and a positive right side vector. We analyze the method and prove its convergence to the desired solution. We report some numerical results based on an implementation of the proposed method using a prediction–correction approach for path following.", "authors": ["Lixing Han"], "n_citation": 0, "references": ["3c820eee-c30b-45ab-a801-2e79ad70a69f", "5f291712-9cb5-416d-9a8a-f916d87c840b", "7ff9789a-b6d3-4f8b-bb92-bb5b587badb9", "b3b67082-86ea-43f6-bdc1-e1b6e4a0a00e", "d42664c8-d70a-41d6-bdd1-5f13e66a1c24", "f59313c4-4c7e-47dc-9ba9-a8f28da7977c"], "title": "A homotopy method for solving multilinear systems with M-tensors", "venue": "Applied Mathematics Letters", "year": 2017, "id": "0c7d039e-336f-4592-b525-7e0e220b838a"}
{"abstract": "Visible light communication (VLC) attracts increasing attention in intelligent transport systems (ITSs) in recent years, since light-emitting diodes (LEDs) are used as common light source. In this paper, the maximum capacity of VLC channel in ITSs with commercially available LEDs and photodiodes is investigated using the carrierless amplitude-phase (CAP) modulation technique. 312.5Mbps CAP transmission is successfully demonstrated over 10m transmission with a vehicle LED that has a 3dB bandwidth of 2.5MHz.", "authors": ["Yanfeng Mao", "Haifeng Luan", "Weijie Liu", "Runyao Yang", "Meiyu Jin", "Xianqing Jin Xianqing Jin", "Zhengyuan Xu"], "n_citation": 0, "references": ["017a9b63-43f9-48e1-931e-6324f92ec675", "2e5b55e1-b603-489f-a3cb-7a6b764ed373", "2e75da5c-4d9c-405c-b279-3dd9c25a287a", "8657f48e-b4d0-4ea7-aeeb-d2040a39a6cf", "89f87621-b25b-4869-8bbc-a96304e74568", "98bd7bf7-7548-4cbd-9700-27eb58f818a1", "a8188e21-9712-4056-924f-9e48fa0e127b", "d02d3ba0-6702-43d6-b3ca-1b899aa3c300", "e32fa82b-c64a-4fa1-b97d-96d266a6c72a"], "title": "Experimental investigation of carrierless amplitude-phase transmission for vehicular visible light communication systems", "venue": "international conference on conceptual structures", "year": 2016, "id": "0cce9b12-27a9-4aa1-8226-a5d946336eca"}
{"abstract": "The purposes of this study are mainly to investigate the relationships among website features (i.e. utilitarian and hedonic features), user experience, perceived value (i.e. information value, experiential value, social value, and transaction value), user attitude, and behavioral intentions (i.e. intention to use and word-of-mouth intention), and additionally the mediating effects of user experience and attitude are also explored in this study in an online gamification context. Specifically, this study applies a structural equation model to test the causal relationships among those website features, user experience, perceived value, user experience, and behavioral intentions in an online gamification context. Results show that both utilitarian features and hedonic features have significant impact on users’ experience, which in turn affects their perception of value and attitude. Users’ perceptions of information and transaction value also significantly affect their attitude, and in turn affect their behavioral intentions. Besides, the mediating effects of user experience and attitude are also confirmed in this study. To summarize, the findings of this study can help website managers improve their users’ perceptions of value and attitude more effectively and act as a guide for research and development (R&D) of gamification to acquire competitive advantage and further evoke desired behavioral intentions.", "authors": ["Chia-Lin Hsu", "Yen-Chun Chen", "Tai-Ning Yang", "Wei-Ko Lin"], "n_citation": 0, "references": ["2df731d1-37e4-4afb-a9b0-60a5361a79ff", "3b7b755c-b7a6-4bf6-a1de-3eed75e50eff", "460b56a6-d9ff-4e34-960d-0f0805262b88", "54911c29-ab00-46c6-883e-4df97c0df1c1", "659657d9-66a6-4759-bf0e-1235b60758bb", "679148a5-48e3-4daf-9ef6-31d4a08bf330", "6b5c8aae-782f-4ed3-949b-a150486924e5", "74014aad-6165-4500-a9f5-65c7d4516be0", "75c5360b-18ad-4dd6-ab43-229d4b02bb3d", "79afb9f0-5a7b-47b6-952b-4e18bdd1674a", "866c2a31-34a7-444c-bc9b-5d97c085c25a", "95f17033-1fa7-40e2-91a1-20f70140dfc2", "9920dd78-68d6-4a27-8047-84cc96acf70a", "ad34ea29-5a2d-47d2-83f4-7e61fe42e5d4", "ae0af874-6edb-4345-86f0-bd86c058522b", "b584d0f7-d152-47a5-9825-d303afe88742", "bbc5067e-2e87-4fe2-9b4d-a0831234e044", "bf0a2af5-197c-4585-a63b-14c166417de6", "cf4fc727-58ec-40d9-aaa9-5aae209d634c", "e4fe8ca2-d490-46d0-8aef-1ccaa3f373fa", "e77af969-ba5f-4337-859f-3ee09dee6e51", "efdae899-db16-40b8-965d-9aebbd3eab80", "f5dd0c95-72d3-4c72-9eeb-f8fbcf3434df", "f7b13770-5076-4eb9-9725-ea1465cd4da9"], "title": "Do website features matter in an online gamification context? Focusing on the mediating roles of user experience and attitude", "venue": "Telematics and Informatics", "year": 2017, "id": "0ce8e6fd-3a31-40fa-a95f-e63367fd28ad"}
{"abstract": "This paper introduces a novel structure of multi-segment encoder with MOS current mode logic (MCML) multiplexers. As the benefit, the more segments would lead higher performance speed. Moreover, in the high-resolution flash analog-to-digital converter (ADC), the encoder structure will be simpler compared to conventional ones. As the simplest type, the two-segment encoder is used in this paper. By assistance of some MCML multiplexers, each segment encodes the most significant bits (MSBs) and the least significant bits (LSBs) separately. The figure of merit (FOM) of the proposed ADC is 0.225 pJ/conversion-step.", "authors": ["Masumeh Damghanian", "Seyed Javad Azhari"], "n_citation": 0, "references": ["1c650542-e4c8-49f6-ae62-65f6a2284500", "22f2f9c1-5061-4cea-9ba9-4abd22b6a8b9", "289b334b-e855-4167-a2c1-74418f5cfa28", "57e7c1b0-7f3c-4db9-8518-5dbb0498c8eb", "5a12aa4b-f26e-4b49-b7bd-5827ce7d0387", "692ad895-6b34-4c1b-8724-e6b4684c23e3", "9e1c58b7-fa80-4fc3-ad07-3253ce9534af", "b0855e0b-3150-4874-9573-b592295d4c84", "df046816-a3be-4cf3-a57e-5ee14801371c", "e0f75c7b-34b1-4839-8b0e-677ebbc9d6a2"], "title": "A low-power 6-bit MOS CML flash ADC with a novel multi-segment encoder for UWB applications", "venue": "Integration", "year": 2017, "id": "0d16d16b-0457-4b71-a144-180da7ec4d8a"}
{"abstract": "Processed genes are functional genes that have arisen as a result of the retrotransposition of mRNA molecules. We found 6 genes that generated processed genes in the common ancestor of five Brassicaceae species (Arabidopsis thaliana, Arabidopsis lyrata, Capsella rubella, Brassica rapa and Thellungiella parvula). These processed genes have therefore been kept for at least 30 million years. Analyses of the Ka/Ks ratio of these genes, and of those having given rise to them, show that they evolve relatively slowly and suggest that the processed genes maintained the same function as that of their parental gene. There is a significant negative correlation between the number of ESTs and transcripts produced and the Ka/Ks ratios of the parental genes but not of the processed genes. This suggests that selection has not yet adapted the selective pressure the processed genes experience to their expression level. However, the A. thaliana processed genes tend to be expressed in the same tissues as that of their parental genes. Furthermore, most have a CAATT-box, a TATA-box and are located about 1 kb from another protein-coding gene. Altogether, our results suggest that the processed genes found in the A. thaliana genome have been kept to produce more of the same product, and in the same tissues, as that encoded by their parental gene.", "authors": ["Basma T.M. Abdelkarim", "Vincent Maranda", "Guy Drouin"], "n_citation": 0, "references": ["bf7e4268-53e0-43e6-8eea-6a45b124e97b", "f131fff4-5225-4af3-af1f-7484ce09c058", "fc2d34aa-281a-4bb5-b214-3e2122948f44"], "title": "The fate of retrotransposed processed genes in Arabidopsis thaliana", "venue": "Gene", "year": 2017, "id": "0d2ee367-dca4-4904-8504-1a662891b7f0"}
{"abstract": "Envelope Tracking Power Amplifier (ET PA) is becoming prevalent because of its higher power efficiency (compared to its linear PAs) and higher linearity (compared to other high power-efficiency PAs such as Envelope Elimination and Restoration PAs and outphasing PAs). Of various building blocks in an ET PA, the supply modulator is the most critical block as the supply modulator has major effect on the overall performance of the ET PA, including bandwidth, linearity, power-efficiency, etc. In this paper, a comprehensive literature review on supply modulators for ET PAs is provided. Various supply modulator design architectures are discussed, and their advantages and drawbacks compared. The key design parameters and design trade-offs are also delineated. The reviews and discussions herein provide useful references and valuable insights to supply modulator designers.", "authors": ["Huiqiao He", "Tong Ge", "Joseph Sylvester Chang"], "n_citation": 0, "references": ["3177e793-8902-4d6a-b25d-787c69d6e930", "354a3918-4497-4101-b89a-bc81e1258f48", "3e874027-647e-45ef-bbe2-fbfcceb67d2e", "4fa6c5e7-4857-4929-8da2-205b7af448ba", "ef797d87-5f47-417c-bee1-f08c69760d61"], "title": "A review on supply modulators for Envelope-Tracking Power Amplifiers", "venue": "", "year": 2016, "id": "0d8f9eab-3feb-4ad4-aa0b-1e7637cce80a"}
{"authors": ["Jie Li", "Jinsong Wu", "Periklis Chatzimisios", "Majed Haddad", "Kun Yang"], "n_citation": 0, "references": ["53694ded-160d-48dd-a4f1-4d958f7cc615", "71c68f2b-286a-4c85-88ce-9ba39a008602"], "title": "Ieee Access Special Section Editorial: Special Section on Big Data for Green Communications and Computing", "venue": "IEEE Access", "year": 2016, "id": "0da69d26-0fd4-491f-8dc6-e8df929c990e"}
{"authors": ["Rafael A. Calvo", "David N. Milne", "M. Sazzad Hussain", "Helen Christensen"], "n_citation": 50, "references": ["0500ddbe-e274-477b-bb6b-54a7269e4577", "19d8e565-399d-47a8-bd30-8ff4fe857892", "1c8ea639-396d-4750-a40e-9a579375f91b", "2b8911c8-d192-4143-b0a9-a2128a85ac98", "309e7b1f-f32d-4884-81ee-b83ba5144f74", "4999d336-49af-41ce-9913-fd57fc25c676", "4adb467d-dacf-4019-b0d5-28ce1f323cf4", "4b5ffc7f-3b79-4e40-ae36-3a54584df9a5", "51196295-52ee-42f2-a94a-3076a739bee2", "948238ee-e7d0-478f-b6f8-49ba7fbe2b1a", "a7b0c198-07a3-4474-96b7-3ef8eadaa0f2", "b63854f8-7584-428f-95c3-31296028354a", "bf9ad201-b2d6-4ac7-9cf6-7a0f71d8e3fd", "ca3d3040-0efd-44fd-a4b1-b8baee8f4bfe", "da55b14c-6cac-44aa-8620-aa2d1210551b", "de571095-d1d5-4fb0-8f02-8b7423d1e0c3", "f6c28a96-eebd-4133-84eb-24c42e5feac1", "f6c8cd2c-6820-4c34-98ca-1c237b549cbb"], "title": "Natural language processing in mental health applications using non-clinical texts", "venue": "Natural Language Engineering", "year": 2017, "id": "0dc22c5d-5238-4b52-a844-e378399f7c57"}
{"abstract": "Fault Tree Analysis (FTA) is a well-established and well-understood technique, widely used for dependability evaluation of a wide range of systems. Although many extensions of fault trees have been proposed, they suffer from a variety of shortcomings. In particular, even where software tool support exists, these analyses require a lot of manual effort. Over the past two decades, research has focused on simplifying dependability analysis by looking at how we can synthesise dependability information from system models automatically. This has led to the field of model-based dependability analysis (MBDA). Different tools and techniques have been developed as part of MBDA to automate the generation of dependability analysis artefacts such as fault trees. Firstly, this paper reviews the standard fault tree with its limitations. Secondly, different extensions of standard fault trees are reviewed. Thirdly, this paper reviews a number of prominent MBDA techniques where fault trees are used as a means for system dependability analysis and provides an insight into their working mechanism, applicability, strengths and challenges. Finally, the future outlook for MBDA is outlined, which includes the prospect of developing expert and intelligent systems for dependability analysis of complex open systems under the conditions of uncertainty.", "authors": ["Sohag Kabir"], "n_citation": 0, "references": ["0bd78023-c740-4bbe-8807-d87be5b0d088", "1876a396-b10d-48b8-b4a9-ca663794ac4d", "1970c985-e895-45d9-9e45-719fada3df34", "26743eca-3609-4ba5-8df9-7bd41e5cb07f", "28f9433a-902e-43cd-b1ee-44662b83a766", "2d1b3485-4b45-4f2f-882e-6c6239c3ae70", "3177e2ed-fec7-4ec3-a07a-23de5863ff7a", "3ab83a67-730d-409c-88f1-6d7a40b94d62", "3c121483-eb34-4469-8c96-571803e60390", "3dcd5238-aeca-4b56-ac2b-731734266aa8", "47402925-53ea-4dca-a27a-808e38a8b823", "4cc7b4b0-4d9f-45d1-8649-feedeb08f42b", "4d01c0d1-66a4-4dfb-9cfb-c09ca99167e7", "4dab6a2c-ffc1-4d93-99ae-a3e44894977a", "4ec47d0b-663b-46e4-866a-1c671d0d9034", "5131e919-945a-4688-a6dd-0289df9c6ac1", "5f729152-17aa-4451-86b8-7bc6897f10a5", "654ee004-e0c8-4cfa-b9b8-bcee306294e6", "65590785-c4ce-40e4-9819-3a245ec840bc", "6c3710bb-32ec-4ccf-95d8-da077b792801", "6d78a43d-e1c5-4386-b3bf-69f4c8f81455", "70cd3bd2-d2b3-415e-a9b2-3fa5a57f637b", "75a5f397-46d9-4856-bb3b-710272134a00", "76e45cd3-cd9b-4b21-9fe3-950dcbd17488", "7c01ded7-203f-404b-8041-3ae4ab394436", "7f103dc0-c2cd-4b26-a130-ba715091de1b", "871e77b4-2aa5-423f-a9e9-a8d54e81e4ad", "8baf5d66-b012-47d4-adcb-e307c513d409", "8c653dbe-d30f-4165-afd0-f6ed1b370d96", "8d4a30a9-10e2-4ff1-94ee-bc3754d78633", "914207ee-80f8-47bf-a6ab-2f24599d52ca", "924882c4-c899-4d81-b285-c4fd4a561e9b", "9840e14b-dc41-4813-b128-e00829234db7", "98f5968e-56c3-4f6b-a84c-5649e1f76968", "99dc0069-bc35-4cf3-8f91-33f503edbd2e", "9b4344ca-8804-403b-a424-6388b00ae599", "9c83d335-e6c4-4e15-ae49-1dcd2dbc3dc2", "9cc13157-0bc1-457c-abe0-ee9792e522e4", "9cc21dbf-ca3d-4735-ace9-f574a6d6d7ba", "a3131c28-098f-45b5-893c-9ee0f67fd41d", "a9199216-fb79-45fa-85db-d70082194260", "a989b338-adfc-457c-8302-618990da9b7e", "ab2bef51-025d-47b7-9ec7-4cb484fe6a6b", "ab81efe8-4a6c-4280-aa8d-25e964a74131", "b3035117-2e8f-4738-bff1-1ae434873cf5", "b3f8a3bd-2ee6-49bd-af31-cf46e3877c15", "b47ca9ec-49d0-4797-a417-33f706120572", "b4c4b0fd-eb80-444b-a13a-67288f6487af", "b744bc5b-8cb0-4d44-abbd-43448ac4d3d8", "c44237d3-ca2f-45c8-8e94-6a73f1ae107d", "c4b966ab-471f-4e50-8785-a340e6769b18", "d04b907c-84d4-4045-be81-3e8f6e61238c", "d7b9aeb4-9bd5-4bc9-9d49-78b4bb889698", "d7e76294-e7bc-40ef-8f90-4f013506896e", "d91ab2bc-cecb-40b9-a82a-73383093ade8", "da9d91bb-4e25-4c46-a6a5-4f3a414a43f2", "dacbb475-2415-4fbe-9382-011468fd8e0a", "dd42f477-8053-4467-a14c-0018c5765b51", "df8de5ba-4e92-4ab7-989a-6d844b951cd7", "e57672b8-d478-422f-9f9e-266cb441497f", "e57bc784-98cc-4137-9052-0f702067a44d", "e77dbb25-e545-4602-850d-d1afec2173a9", "e904d459-803b-4e69-a373-6ec0cf84a604", "ebd2e42e-3388-45ab-be76-19f966b4bbca", "ef1a9789-d7c7-47a9-8a8a-3fcc9d423659", "ef92d0cf-5704-483b-b8a5-197518bd7f5b", "f91e000b-9945-4634-82ce-c6321bc2f01f", "f98f00f9-0763-4066-918c-c31ab6487419", "f9d26fc5-2df2-4fca-9b43-473cd47b7a72", "fb1992a3-7d57-4196-9df3-ab7e074314e2", "fc52e1bc-eec2-406f-9618-d9107f8c8754", "fc598e8c-c24b-4fba-8019-861f76f55212", "fc5d4b1a-8943-42dd-82a7-a4b367e91876"], "title": "An overview of fault tree analysis and its application in model based dependability analysis", "venue": "Expert Systems With Applications", "year": 2017, "id": "0dde46d3-c56f-4862-8931-793ecb82df64"}
{"abstract": "Ontologies are being increasingly used in a varied number of fields such as knowledge management, information extraction, and the semantic web. In this context, it's possible to verify the feasibility of using ontologies in healthcare. The number of seropositive people in relation to HIV, and its early detection is still a problem in today's world, especially in Brazil. Therefore, this study reports the creation and evaluation of an ontology meant to be used in healthcare applications, focused on telehealth. This ontology's main objective is to define the profiles of patients who attend the health centers of a city. The ontology proposed here can be used in a range of applications related to healthcare, not only to HIV, but also other diseases categorized as chronic. The article details the creation of ontology and its grounding. The evaluation that was made is described and its results, which are considered promising, are commented.", "authors": ["Kevin Cardoso de Sa", "Felipe Lauermann Vielitz", "Fabio Rafael Damasceno", "Cristiano André da Costa", "Sandro José Rigo", "Rodrigo da Rosa Righi"], "n_citation": 0, "title": "A proposal of knowledge base for applications in the scope of HIV/AIDS", "venue": "", "year": 2016, "id": "0de1ea81-5dbf-4fc3-a11e-f5cdd75f5786"}
{"abstract": "In this paper, we focus on online representation learning in non-stationary environments which may require continuous adaptation of model architecture. We propose a novel online dictionary-learning (sparse-coding) framework which incorporates the addition and deletion of hidden units (dictionary elements), and is inspired by the adult neurogenesis phenomenon in the dentate gyrus of the hippocampus, known to be associated with improved cognitive function and adaptation to new environments. In the online learning setting, where new input instances arrive sequentially in batches, the neuronal-birth is implemented by adding new units with random initial weights (random dictionary elements); the number of new units is determined by the current performance (representation error) of the dictionary, higher error causing an increase in the birth rate. Neuronal-death is implemented by imposing l1/l2-regularization (group sparsity) on the dictionary within the block-coordinate descent optimization at each iteration of our online alternating minimization scheme, which iterates between the code and dictionary updates. Finally, hidden unit connectivity adaptation is facilitated by introducing sparsity in dictionary elements. Our empirical evaluation on several real-life datasets (images and language) as well as on synthetic data demonstrates that the proposed approach can considerably outperform the state-of-art fixed-size (nonadaptive) online sparse coding of Mairal et al. (2009) in the presence of nonstationary data. Moreover, we identify certain properties of the data (e.g., sparse inputs with nearly non-overlapping supports) and of the model (e.g., dictionary sparsity) associated with such improvements.", "authors": ["Sahil Garg", "Irina Rish", "Guillermo A. Cecchi", "Aurelie C. Lozano"], "n_citation": 0, "title": "Neurogenesis-Inspired Dictionary Learning: Online Model Adaption in a Changing World", "venue": "arXiv: Learning", "year": 2017, "id": "0e2e0417-1064-471e-85ad-faeace63c084"}
{"abstract": "The existing methods for texture modeling include co-occurrence statistics, filter banks and random fields. However most of these methods lack of capability to characterize the different scale of texture effectively. In this paper, we propose a texture representation which combines local scale feature, amplitude and phase of wavelet modules in multi-scales. The self-similarity of texture is not globally uniform and could be measured in both correlations across the multi-scale and statistical feature within a single-scale. In our approach, the local scale feature is represented by optimal scale obtained through the evolution of wavelet modulus across multi-scales. Then, for all the blocks of the same optimal scale, the statistical measurement of amplitude is extracted to represent the energy within the corresponding frequency band; the statistical measurement of the phase of modulus is extracted to represent the texture's orientation. Our experiment indicates that, in the proposed texture representation the separability of different texture patterns is larger than the one of the traditional features.", "authors": ["Sheng Yi", "Hanqiang Cao", "Xutao Li", "Miao Liu"], "n_citation": 0, "title": "A new texture representation with multi-scale wavelet feature.", "venue": "", "year": 2006, "id": "0e5ba392-571f-4e50-a0be-6e4b208fdb63"}
{"abstract": "Asynchronous Radio Duty Cycling (ARDC) protocols can make embedded networked devices more energy efficient by keeping their radio off most of the time without a need for synchronization between devices. Some ARDC protocols can operate under 6LoWPAN adaptation layer in order to enable the vision of Internet-of-Things for battery operated devices. In this paper, we propose three different protocols which are modifications of the widely accepted ARDC protocol, ContikiMAC. The proposed solutions drastically improve energy efficiency and link layer delay for broadcast packets. Moreover, the proposed solutions are backward compatible with ContikiMAC and provide high reliability against frame reception errors. We present a detailed comparison with the legacy ContikiMAC and a standardized ARDC protocol, IEEE 802.15.4e Coordinated Sampled Listening (CSL), as well as the case of no duty cycling.", "authors": ["Salih Serdar Guclu", "Tanir Ozcelebi", "Jj Johan Lukkien"], "n_citation": 0, "references": ["1211daf3-eab2-4810-9272-2dd71a809656", "16a43bb9-ad3d-4310-9034-f06427d81af3", "d12d111a-c357-4bf0-b357-0ce1009e7e09"], "title": "Improving Broadcast Performance of Radio Duty-Cycled Internet-of-Things Devices", "venue": "global communications conference", "year": 2016, "id": "0e5c48c6-347a-4a57-ab78-ee5cbe021c29"}
{"abstract": "In this paper, we study the average sum DoF of cached interference networks over random user requests. First, we derive a closed-form average sum DoF upper bound of the cached interference channels over all possible caching and transmission strategies. Then, we propose an online cache content placement algorithm to maximize the achievable average sum DoF without explicit knowledge of the popularity of the content files. We show that the gap between the DoF upper bound and an achievable DoF is small for some typical scenarios. Moreover, we quantify the DoF gain due to caching with respect to some important system parameters. We show that large DoF gain over interference network without cache is possible even if the number of files    $L\\rightarrow \\infty$   . Both simulation and analysis indicate that the proposed scheme has significant gains over various baselines.", "authors": ["Wei Han", "An Liu", "Vincent Kin Nang Lau"], "n_citation": 0, "references": ["01f6b244-3daa-4c7b-b22f-6d7a8760a936", "021acdc3-869a-400a-ab2a-49f1a7dd17d4", "08ff6957-73f8-4d43-80cd-70a4c0da797c", "0f358b15-7efd-4389-9659-aa0fda4615c9", "1eddb4e0-a074-4189-a370-e53724a96bbd", "7757c456-2228-416d-955d-c7a2eaf65e7a", "8176e505-a125-4c5e-9130-8e270f679688", "916831ac-d859-4450-a18b-40512953061a", "ac04bf45-d13c-481e-a6e1-7deeb3094c5a", "be56609c-ff16-46db-8c72-499b4a6ff7fe", "d9b08a7f-c2e5-46ed-97a5-41b11b5e4968", "e574edf2-100b-424b-b81b-1b674783cf82", "ece7793c-808e-4849-a3fb-9d5766a545c6"], "title": "Degrees of Freedom in Cached MIMO Interference Networks With Asynchronous User Requests", "venue": "IEEE Transactions on Wireless Communications", "year": 2017, "id": "0ea4ce88-b366-40e9-9a4b-69366a7d66d5"}
{"abstract": "Scientific gait (walking) analysis provides valuable information about an individual's locomotion function, in turn, to assist clinical diagnosis and prevention, such as assessing treatment for patients with impaired postural control and detecting risk of falls in elderly population. While several artificial intelligence (AI) paradigms are addressed for gait analysis, they usually utilize supervised techniques where subject groups are defined a priori. In this paper, we explore to investigate gait pattern mining with clustering-based approaches, in which k-means and hierarchical clustering algorithms are employed to derive gait pattern. After feature selection and data preparation, we conduct clustering on the constructed gait data model to build up pattern-based clusters. The centroids of clusters are then treated as the subject profiles to model the various kinds of gait pattern, e.g. normal or pathological. Experiments are undertaken to visualize the derived subject clusters, evaluate the quality of clustering paradigm in terms of silhouette and mean square error and compare the results with the discovery derived from hierarchy tree analysis. In addition, analysis conducted on test data demonstrates the usability of the proposed paradigm in clinical applications.", "authors": ["G. F. Xu", "Yanchun Zhang", "Rezaul Begg"], "n_citation": 0, "title": "Mining Gait Pattern for Clinical Locomotion Diagnosis Based on Clustering Techniques", "venue": "Lecture Notes in Computer Science", "year": 2006, "id": "0f2f1974-a986-45ac-a187-25821dbb50b0"}
{"authors": ["Axel Müller", "Merouane Debbah"], "n_citation": 0, "title": "Tutoriel sur les matrices aléatoires – Introduction aux équivalents déterministes", "venue": "Traitement Du Signal", "year": 2016, "id": "0f85b4c8-372b-4ff3-853a-ff6f9a184ae2"}
{"abstract": "Sparse code multiple access (SCMA) is a new non-orthogonal multiple-access technique in future wireless networks. In SCMA uplink burst transmission, user detection and channel estimation require significant pilot overhead. Dispersive channels with relative small coherent frequency / time, as well as fading diversity techniques, both lead to a result that multiple fading blocks are taken during one transmission. In this paper, a new method of separating SCMA user detection and channel estimation among different fading blocks in dispersive channels is proposed to reduce pilot overhead. Further more, according to the sparsity of SCMA codebooks, a new mapping pattern from SCMA layers to physical resources is proposed to improve channel estimation performance with given pilots. The effectiveness of the proposal are described and analyzed, meanwhile the complexity is evaluated. Numerical simulations are performed to substantiate the performance of the proposed algorithm.", "authors": ["Yufeng Wang", "Xiujun Zhang", "Shidong Zhou", "Jin Lian", "Limin Xiao"], "n_citation": 0, "references": ["5676a18d-f67f-4846-9dfc-8c0f3828ae7f", "69b9ef96-11d5-49b0-9ae3-492763e02ca8", "af6d91d3-3a39-400c-8130-ca744d2b1fe3", "cad96854-226b-4f74-9822-f347689973b7", "ee4d487c-ae4b-4707-a6c4-c8801d916f41", "f068493b-868a-4bbe-a2a5-f291f9869553", "f56b877b-4060-4754-b303-e8140968544c", "fcf57c11-e485-4ea7-aead-52266a42b5ac"], "title": "User detection and channel estimation for SCMA uplink system in dispersive channel", "venue": "international conference on conceptual structures", "year": 2016, "id": "0f9c0bcc-989e-4990-9717-ced2a0d98c6b"}
{"authors": ["Haoxi Li", "Haoshan Zou", "Haifeng Hu"], "n_citation": 0, "references": ["03d100b4-54e1-49dd-ad16-23bf3e25cae0", "14622286-eb4f-46cf-96bc-58672a48cf0c", "166faf75-06e2-46ac-bf00-7c930f220ecf", "1f7ded38-bcda-48db-9f63-a481f0ebab33", "206da0af-53f2-4208-b5a0-04e383080f92", "246052a8-ada0-414a-8d41-f46c06008f91", "261f1779-0600-4a88-af9c-7b2ac764d785", "26bf43b4-61b7-499e-8caf-7b74b6de070d", "33b5d611-f8ab-4fca-8397-65213653fd82", "4d005cf3-06f3-432f-8bc7-2185ad261847", "5781743b-057e-40f8-9514-54434d1fd0b0", "5d21b309-26cd-49ec-9c25-439ffe8d64d4", "68b99920-42dc-496d-9383-2faf2996060f", "767319b3-1d27-402f-b411-7a158ad19ae5", "76dc2876-c10c-4fe4-8312-cf19cea1c06c", "867ad205-8936-491e-a8b9-12081579c8ed", "8a74c4be-6c80-48eb-9d75-6c5ede55364c", "964100e2-dd91-4d2f-bba6-5f3cc5ab87ce", "9918a1a7-8a09-44a3-a713-84d1db44c027", "a0805990-8b90-460c-a446-27763979a2ff", "ac8042ed-656f-4c80-bce9-8c7209676921", "b39e6f1c-c41c-4846-a1ba-864e73c6ce27", "bafe7c20-87d1-4bb4-8cbe-356ac54641bc", "c96c3534-c528-416d-9853-580903448f82", "cee5f6c7-68c8-4bed-b233-5cdb5463ddc7", "d32f7355-0da3-4100-9e4e-5555a70b48d6", "dd83785a-dd19-41e3-9b25-ebabbd48d336", "df25a564-93d6-4d3f-8b84-1bd86fd679db", "ee1b00df-44f8-405c-b96c-02080d3105cf", "f1d4fbdc-fa80-4452-90dc-d36ca5a13ac3"], "title": "Modified Hidden Factor Analysis for Cross-Age Face Recognition", "venue": "IEEE Signal Processing Letters", "year": 2017, "id": "0fb039c8-3a84-401d-88d7-a70d9f7580e2"}
{"abstract": "In conventional cognitive radio ad hoc networks, both primary users (PUs) and secondary users (SUs) are typically equipped with omni-directional antennas, which can cause high interference. As a result, SUs usually suffer from the poor network connectivity due to the high interference caused by PUs. Different from omni-directional antennas, directional antennas can concentrate the transmission on some desired directions and reduce interference on other undesired directions. In this paper, we investigate the network connectivity of a novel cognitive radio ad hoc network with directional antennas (DIR-CRAHNs), in which both PUs and SUs are equipped with directional antennas. We derive the local connectivity (i.e., probability of node isolation) of such DIR-CRAHNs in closed form and numerical results show that the proposed DIR-CRAHNs have higher local connectivity than conventional cognitive radio ad hoc networks.", "authors": ["Yuanyuan Wang", "Qiu Wang", "Hong-Ning Dai", "Haibo Wang", "Zibin Zheng", "Jianqing Li"], "n_citation": 50, "references": ["02eefe0f-b029-4fbb-b41a-906e8f04639d", "13ac5802-3811-4b08-87e6-0c3edcd92685", "1c94269b-6b47-4936-b0aa-9d31735221e8", "1cc30c72-ce4d-455d-874c-048e4cc779b2", "32591c3e-f867-4910-91ec-ce8d8113767a", "46d469d5-52d9-4942-8cc4-dc0d3298db31", "6acdadd8-d600-432b-a16f-b73178eea9ab", "78ccfb67-cefb-403e-add3-121fa5d343cc", "8a01f6c3-bbb1-4a91-a4a9-c35a666e2f64", "9fc38ada-a1cb-4782-8aae-245382f0291c", "a840b0e6-5316-4765-a6a5-8575cae24462", "b802ec9a-598f-4a5e-9b04-8d235cd5d1e3", "b96a519c-db34-4bd3-82b4-5ffee1a5d906", "ec2bb91a-b29c-46fe-85bd-ce00e75244e7", "ee566d37-b546-4775-a131-c51c5ffe771f", "ef12e54a-5979-48a5-99ec-76efd25b2766", "f1ad6ac0-4021-4e86-b7b6-9d824a689eb8"], "title": "On local connectivity of cognitive radio ad hoc networks with directional antennas", "venue": "international conference on conceptual structures", "year": 2016, "id": "0fd1ed08-cbb9-4d3a-a08d-629dab7b0c12"}
{"abstract": "We present a framework for creating network FPGA clusters in a heterogeneous cloud data center. The FPGA clusters are created using a logical kernel description describing how a group of FPGA kernels are to be connected (independent of which FPGA these kernels are on), and an FPGA mapping file. The kernels within a cluster can be replicated with simple directives within this framework. The FPGAs can communicate to any other network device in the data center, including CPUs, GPUs, and IoT devices (such as sensors). This heterogeneous cloud manages these devices with the use of OpenStack. We observe that our infrastructure is limited due to the physical infrastructure such as the 1~Gb Ethernet connection. Our framework however can be ported to other physical infrastructures. We tested our infrastructure with a database acceleration application. This application was replicated six times across three FPGAs within our cluster and we observed a throughput increase of six times as this scaled linearly. Our framework generates the OpenStack calls needed to reserve the compute devices, creates the network connections (and retrieve MAC addresses), generate the bitstreams, programs the devices, and configure the devices with the appropriate MAC addresses, creating a ready-to-use network device that can interact with any other network device in the data center.", "authors": ["Naif Tarafdar", "Thomas Lin", "Eric Fukuda", "Hadi Bannazadeh", "Alberto Leon-Garcia", "Paul Chow"], "n_citation": 0, "references": ["206329f4-ce86-4dfb-99fe-cf6f6d406761", "5f6fffac-894a-407e-97c0-0dbd64b596a4", "9b2538f1-6445-4916-9055-654c8d1691f3", "ba6b59e3-0bc3-4c22-81ee-899a4a1a9552", "c21a45c4-2215-48f1-9012-05b154d2e5d2"], "title": "Enabling Flexible Network FPGA Clusters in a Heterogeneous Cloud Data Center", "venue": "field programmable gate arrays", "year": 2017, "id": "0fea982c-3e4b-48eb-ae67-9641d3fe266b"}
{"abstract": "Speech perception and comprehension are often challenged by the need to recognize speech sounds that are degraded or ambiguous. Here, we explore the cognitive and neural mechanisms involved in resolving ambiguity in the identity of speech sounds using syllables that contain ambiguous phonetic segments (e.g., intermediate sounds between /b/ and /g/ as in “blade” and “glade”). We used an audio-morphing procedure to create a large set of natural sounding minimal pairs that contain phonetically ambiguous onset or offset consonants (differing in place, manner, or voicing). These ambiguous segments occurred in different lexical contexts (i.e., in words or pseudowords, such as blade–glade or blem–glem) and in different phonological environments (i.e., with neighboring syllables that differed in lexical status, such as blouse–glouse). These stimuli allowed us to explore the impact of phonetic ambiguity on the speed and accuracy of lexical decision responses (Experiment 1), semantic categorization responses (Exper...", "authors": ["Jack Rogers", "Matthew H. Davis"], "n_citation": 0, "references": ["246bc37a-1ac5-415b-9e43-9be781df59db", "2470f8c1-dca7-4801-82c3-76389d07fcb2", "60190ab3-5104-43f3-9fbd-5d8d00ff296c", "89be9d96-002c-4647-a222-28920788d783", "8d30f7b1-6daf-411b-b822-a6e47f7d1628", "aa750fe3-9b58-4093-9544-420081028d6b", "cbc15180-809e-4372-851d-f0d07b662d7c", "d162389a-ecf0-4c86-a4c6-e4abbe7e4537", "d9254a09-c2aa-4e31-a066-184171d87833", "dffda390-7db2-4a1d-90e9-a1aa59383001", "e483f641-f7f8-43dc-a649-ced3e3d67b06"], "title": "Inferior Frontal Cortex Contributions to the Recognition of Spoken Words and Their Constituent Speech Sounds.", "venue": "Journal of Cognitive Neuroscience", "year": 2017, "id": "1032c089-6dc4-40b7-bfe3-fec28c7d358d"}
{"authors": ["Chang-Mo Yang", "Yo-Sung Ho"], "n_citation": 0, "title": "Embedded image-coding algorithm using set partitioning in block trees of wavelet coefficients.", "venue": "visual communications and image processing", "year": 2002, "id": "104e9d1b-6d07-442e-a7c0-71cbcb67dde3"}
{"authors": ["Shale Xiong", "Pedro da Rocha Pinto", "Gian Ntzik", "Philippa Gardner"], "n_citation": 0, "references": ["03141375-fc8f-4c36-b0c6-a15e19eda5e4", "15315beb-6cf9-43c5-9090-41b31ac8b39f", "1c051b8f-b108-4fff-9cb5-803e8c916119", "1ea07761-7e51-44b3-86a9-b820f14d26d4", "22ccf5db-2fb9-4c04-96d3-ab1a4fa39a6f", "5431dd1d-a8ee-4129-a087-9453b13c0c32", "56262a60-f99f-401f-82da-51e8e315b117", "5aa415df-64b6-498a-9a72-d69abac6bdbc", "68949385-139b-4294-a087-e45165561fbc", "6aa6ae65-7537-4ed8-9339-a2abd2ff3c7b", "6c4e8a84-bfb1-4793-99dc-1ae4f4443dbd", "748e7bd6-4d6f-4253-9a1e-ff1f8d01b1e8", "7c0d0439-5f81-4ce9-a962-26930bd4c5d2", "7eafd26d-4072-4bee-8e4b-c12862219012", "86416151-0e16-418c-bd00-750886ef8af3", "8953ad76-dee2-43a8-8c7c-a66dc24d0243", "8ff88e7c-9c68-4b64-abb9-e973e717bb32", "927a57cd-0b9f-4c5f-bf07-11cecb7624b0", "9e9eccfe-69f5-449e-b534-6048ec6ad3e9", "aca630e2-0674-40af-b48e-6d62736231ef", "b65531c4-e179-4e72-bbef-8d6a8d901ddb", "bc2e7029-48bb-48e1-ba35-432fc47c1889", "bd2f6141-fda3-498f-9331-fb66034ae7fb", "cd263b3d-af90-4677-a706-da1412139647", "d057a535-fa3e-4636-b4c8-6a291f96eda9", "f42e9a72-7ce6-405f-8515-05960a999108"], "title": "Abstract Specifications for Concurrent Maps", "venue": "european symposium on programming", "year": 2017, "id": "10680108-43e9-42e5-9029-1d8f2eea7f7a"}
{"abstract": "Nearly fifteen years ago, Google unveiled the generalized second price (GSP) auction. By all theoretical accounts including their own [Varian 14], this was the wrong auction --- the Vickrey-Clarke-Groves (VCG) auction would have been the proper choice --- yet GSP has succeeded spectacularly.#R##N##R##N#We give a deep justification for GSP's success: advertisers' preferences map to a model we call value maximization; they do not maximize profit as the standard theory would believe. For value maximizers, GSP is the truthful auction [Aggarwal 09]. Moreover, this implies an axiomatization of GSP --- it is an auction whose prices are truthful for value maximizers --- that can be applied much more broadly than the simple model for which GSP was originally designed. In particular, applying it to arbitrary single-parameter domains recovers the folklore definition of GSP. Through the lens of value maximization, GSP metamorphosizes into a powerful auction, sound in its principles and elegant in its simplicity.", "authors": ["Christopher A. Wilkens", "Ruggiero Cavallo", "Rad Niazadeh"], "n_citation": 50, "references": ["03320467-a15f-43df-bcfc-cfe86c167b50", "21da5d13-8f89-4978-b72c-fdd3492c1d37", "2a277b2c-fbfe-4899-9538-49128a9aef3e", "660cb5c6-16ad-4561-98de-faaef9d345d0", "69fb178b-ab24-4275-9aea-5ffd2f9d2685", "83b8ad8a-ef10-4188-a22d-ae98fecbefb5", "86e6a940-086e-46f2-a839-11777dc593ca", "9853571c-a3ad-4efa-8829-a7b2a8a6ad33", "a8a108cc-8c99-4058-acc0-e43267262c4a", "c143836d-821f-4fbd-9f24-37ee9afcff33", "c29d2651-d755-4588-8062-a3cc2e0027c0", "ce709fc5-1384-4724-9e0e-c1fe30ebb14d", "dcac9581-b58f-4221-93f5-ffa4d1793eb8"], "title": "GSP: The Cinderella of Mechanism Design", "venue": "international world wide web conferences", "year": 2017, "id": "108d3159-2542-4974-95d0-1962972a9fa1"}
{"abstract": "The continuous evolution of Next Generation Internet (NGI) amplifies the demand for efficient and secure communication capable of responding effectively to the challenges posed by the emerging applications. For secure communication between two sensor nodes, a secret key is needed. Cryptographic key management is a challenging task in sensor networks as the hostile environment of sensor networks makes it more prone to attacks. Apart from resource constraints of the devices, unknown topology of the network, the higher risk of node capture and lack of a fixed infrastructure makes the key management more challenging in Wireless Sensor Network (WSN). Paper surveys different key Management schemes for WSN. The paper presents the efficiency versus security requirements tradeoffs in key management for WSN. Paper also proposes a novel key management protocol which provides strong resistance against replay attacks. The results obtained from the mathematical model based on conditional probability of the scheme suggest that the proposed key management in NGI is efficient and attack resistant.", "authors": ["Vinod V. Kimbahune", "Arvind V. Deshpande", "Parikshit N. Mahalle"], "n_citation": 0, "references": ["2f5e87db-dd93-4655-a6c7-5808d78cef33", "4abc6eba-0535-46df-94c7-f3a6a7c6f2ed", "8cde5311-3e54-4be3-ab3f-fd943d5aa072", "94420a9b-ff78-4feb-b97c-370390fc083a", "a0c7d384-35d3-4a4b-be74-1a0d0adad68e", "a9e54656-3a5a-4963-b9fd-fb23f48c69fd", "e90264de-2de3-43a3-9172-1168b0824499", "f62e5ae7-d996-4057-ba2f-de0d476f3a28", "fcf02e6f-904d-422b-899c-ee89232b3a76"], "title": "Lightweight Key Management for Adaptive Addressing in Next Generation Internet", "venue": "International Journal of Ambient Computing and Intelligence", "year": 2017, "id": "109590c6-b3c4-40ff-9df3-1874c7668801"}
{"authors": ["G.B.M. van der Geer", "M. van der Vlugt"], "n_citation": 0, "title": "Generalized Hamming Weights of BCH(3) Revisited", "venue": "", "year": 1994, "id": "10bb4e45-47ae-496b-b635-e8962cd5ee6c"}
{"abstract": "Data analytics frameworks shift towards larger degrees of parallelism. Efficient scheduling of data-parallel jobs (tasks) is critical for improving job performance such as response time, and resource utilization. It is an important challenge for large scale data analytics frameworks in which jobs are more complex and have diverse characteristics (e.g., diverse resource requirements). Prior work on scheduling cannot achieve low response time and high resource utilization simultaneously because they cannot accurately estimate the durations of tasks in the queue of a worker machine by using sampling-based approach (including sampling with late binding) for task placement, and thus they fail to place tasks at the best possible worker machine. Also, they do not sufficiently consider the diverse resource requirements of jobs (tasks) for placing tasks on worker machines. To address this challenge, we propose a Dependency-aware and Resource-efficient Scheduling (DRS) to achieve low response time and high resource utilization. DRS takes into account task dependency and assigns tasks that are independent of each other to different worker machines. Also, DRS considers tasks' resource requirements and packs complementary tasks whose resource demands on multiple resources are complementary to each other to increase the resource utilization. In addition, DRS uses the mutual reinforcement learning to estimate the task's waiting time (the duration of tasks in the queue of a worker), and assigns tasks to workers with the consideration of tasks' waiting time to reduce the response time. Extensive experimental results based on a real cluster and experiments using real-world Amazon EC2 cloud service show that DRS achieves low response time and high resource utilization compared to previous strategies.", "authors": ["Jinwei Liu", "Haiying Shen"], "n_citation": 50, "references": ["004b7183-1fb5-4e08-b29a-87c679316171", "0150e049-f8af-4658-9234-692f0471eadd", "01c92637-18cc-4d81-8a61-8c53e14ec3ec", "05ec9566-0998-4bba-9caf-c7a003ca1143", "05f80cf9-60af-4ee7-b1a1-7fe27ef6aeb2", "12b33ad1-126b-481e-b3e8-9136975af65b", "1428ce54-e998-4798-9c4e-e7c3261c46e3", "183b304d-3dbd-4f4f-840c-2f2e2f45192b", "1973143d-036f-434b-8570-4acb3308369c", "1df7e734-702f-4adc-9d4b-f24e7ff28506", "1e78f2d9-f6d5-4e0d-9cbc-a2ebfe9bf315", "240293ef-c638-42fc-84f0-adfcb0154303", "33b89c99-821c-450a-9580-948e7bbde37e", "360adff5-5029-4992-8e6b-b921720864e5", "4a68ca5d-9a2f-48f9-a78e-391c832be405", "59af7e25-c0ee-4af5-acea-a58dfe4ccac4", "5be721f1-db7e-4a6f-a4f5-9e58a3779883", "5c6c859b-47d7-4095-80d2-cdd91a65be75", "72b43f43-1284-485a-8b0c-89a167a6ba7a", "7e3704a4-f84d-4a26-bbf4-67afd2981209", "7ebfbf9d-bef3-4e63-b427-b2f628d37a8f", "9558f1d8-969d-41b4-bcff-d1d0faa61595", "95cb467a-4887-4b11-8e8a-4d14a3acefc4", "9d8465b5-c7bb-4080-be81-385d265030cd", "9f5c18e7-6253-444f-b14a-08575dad708c", "a264226c-b575-4612-9c16-e898de4a0153", "a845e3d3-fd79-47c4-8af4-1d42c3d28390", "b2cd814e-38cb-49a5-86bf-012fe8b4ad26", "b799e57f-99c8-4d6e-b791-8b146bd68c57", "ba73da26-2ff7-4936-9aa8-ae5329ea3c01", "bd9d86a7-c62c-48e4-8ead-49f30c6e889d", "c386124a-ef27-4d52-a323-4941c0277f2a", "c8fa91fc-6264-4fcc-b30f-e1fb1d3bbc00", "d8a4e5b7-2ddf-45c8-8b97-9f72c261eba1", "db5df514-3619-4205-9bde-91875602d716", "f097efb0-b696-4513-82d1-a4dfe881424e", "fa9608b8-d238-462a-a2cf-76182ff7014b", "fbc9491f-ec77-4472-9faf-f6d2f81fc45e", "fcc8fc14-fc6b-46d0-9104-2272f916bddd"], "title": "Dependency-Aware and Resource-Efficient Scheduling for Heterogeneous Jobs in Clouds", "venue": "ieee international conference on cloud computing technology and science", "year": 2016, "id": "11997fa1-0571-413a-bacd-4ae3162353dd"}
{"authors": ["Bahram Lotfi Sadigh", "Shahrzad Nikghadam", "A. Murat Ozbayoglu", "Hakki Ozgur Unver", "Erdogan Dogdu", "S. Engin Kilic"], "n_citation": 0, "references": ["04b60f8e-b69a-458b-a631-3036b9ed86c8", "187a1aef-9207-4e59-b496-7484d6fb0f21", "52b60d49-ee11-4d4e-95b1-14c1623668aa", "6cfa36c6-210f-4f0a-8f59-847a0345541f", "70c415b8-9d2e-47d8-b1ca-7cd99f0abdb4", "7a7718a3-0bab-497c-9c7f-e044838edd00", "8d2b920e-fd3b-4466-9713-b880af98ca43", "99435a7d-a49b-4948-861c-137f669ae0f5", "a0bc80c4-ba0b-4fbc-875e-d13d59a64ebb", "a73767b4-06a9-483e-813f-1ceac6d709f7", "b6fd968a-4567-4418-98b5-3330cc7450f9", "df534516-b89c-403d-9dd9-f93950440602", "e183660b-425e-470c-9e34-79d20119fdef", "f19a7386-ef0b-445f-b7ba-ef9c12206adf", "f4d5fd52-2e17-4a80-871a-b37d29f7de94"], "title": "An ontology-based multi-agent virtual enterprise system (OMAVE): part 2: partner selection", "venue": "International Journal of Computer Integrated Manufacturing", "year": 2017, "id": "1295b90f-5caf-4fbc-b119-723d5fb82030"}
{"authors": ["Mateus de Oliveira Oliveira"], "n_citation": 0, "references": ["36ca6e35-41ee-400c-a310-1794e172dca4", "4c08a0fa-c1a1-45c1-aaf3-6cd5f75cafbd", "7dcd9f62-f2a5-495b-9870-610c19cbdc1a", "8555babf-36a6-4cf1-acae-91632b86b138", "c454bdc9-60ad-4127-84fe-abbb45ba3a76", "d42bbf34-d141-4024-9553-65b7abd6cc8e"], "title": "On the Satisfiability of Quantum Circuits of Small Treewidth", "venue": "computer science symposium in russia", "year": 2015, "id": "129b3a37-e67d-4bd8-9201-f0b91901001a"}
{"abstract": "On June 1st, 2009 flight AF447 from Rio to Paris crashed into the Atlantic Ocean. The safety and legal investigations concluded that human factors have played an important role in the accident. Observing that a number of elements from the report written by the French Office of Investigations for Civil Aviation Safety may be assimilated to known concepts from HCI, we propose to use the report as a case study for HCI research. After introducing the aeronautical vocabulary required to its understanding, we extract the HCI-related elements from the report, and assimilate, organize and translate them into conceptual frameworks from the Model of Action and Epistemology. We hope to foster further research aiming at a more formal modeling of the accident, or to foster the identification of possible improvements of the onboard systems.", "authors": ["Stéphane Conversy", "Stéphane Chatty", "Hélène Gaspard-Boulinc", "Jean-Luc Vinot"], "n_citation": 0, "references": ["56020161-51eb-405a-b589-4acbc8ce7ef1", "97f166c6-e61d-4760-8f0d-3044bfe78dbf", "c168adf4-0512-43ec-9d3f-7819e639bb28"], "title": "The accident of flight 447 Rio-Paris: a case study for HCI research", "venue": "international conference on human computer interaction", "year": 2016, "id": "139ad0e7-ae97-4b63-a792-e97c6d794e23"}
{"authors": ["Vittorio Sanguineti", "Rafael Laboissière", "Yohan Payan"], "n_citation": 0, "title": "A control model of human tongue movements in speech.", "venue": "Formal Aspects of Computing", "year": 1997, "id": "13f49d08-4b78-4e32-be11-d0864c236c2a"}
{"abstract": "This work presents a new low-loss active inductor whose self-resonance frequency and quality factor parameters can be adjusted independently from each other. In order to achieve this property, a new input topology has been employed which consists of cascode structure with a diode connected transistor. Furthermore, the proposed input topology makes the device robust in terms of its performance over variation in process, voltage and temperature. Additionally, RC feedback is used to cancel series-loss resistance of the active inductor, which allows self-resonant enhancement as well. Schematic and post-layout simulation results show the theoretical validity of the design. To validate the design feasibility for process, voltage and temperature changes, Monte Carlo and temperature analysis are done. Suggested structure shows inductor behavior in the frequency range of 0.3–11.3 GHz. Maximum quality factor is obtained as high as 2.1k at 5.9 GHz. Total power consumption is as low as 1 mW with 1.8 V power supply.", "authors": ["Hadi Ghasemzadeh Momen", "Metin Yazgi", "Ramazan Kopru", "Ali Naderi Saatlo"], "n_citation": 0, "references": ["448aedc3-6b48-4846-8739-00caa4a76807", "4c3d135a-0755-4e5f-930d-c58a12eb2997", "5ff5e7c7-b2f3-4967-b8e7-6ae06fc2fce7", "f224afc1-b26f-4685-84b1-b17291d0163d"], "title": "Low-loss active inductor with independently adjustable self-resonance frequency and quality factor parameters", "venue": "Integration", "year": 2017, "id": "1415168c-3259-43f5-9fcc-8065b9becd5e"}
{"authors": ["Karthikeyan Bhargavan", "Ricardo Corin", "Pierre-Malo Deniélou", "Cédric Fournet", "James J. Leifer"], "n_citation": 0, "references": ["010f6cba-52b9-44b4-afe8-18868db11c1f", "21cbd69d-a926-4aee-989b-7384c3b86715", "3f21b835-6930-4813-9d9b-2b23b302eb74", "4c3af0b8-b358-440e-9e1a-3e169569e951", "61643156-d1d8-479e-b1df-367a3c06ddc2", "86f11112-b375-406d-98b2-c86b7521d69f", "8e6267bd-0dc1-4bc8-9f48-b0a3ddde4d93", "947b7da7-23da-4fd2-821a-e2de424cb559", "967be506-6e53-4e27-aa40-4f91f0486460", "a47beac7-91d7-42bb-9b0f-07e581dde1e0", "c4a6522a-835c-4f12-adca-fecbb1f2598f", "dfdafd84-ce57-4b9c-b503-341729225e72", "f220ce86-06f0-4020-9f2c-3d7e4d1c76f9"], "title": "Cryptographic Protocol Synthesis and Verification for Multiparty Sessions", "venue": "", "year": 2009, "id": "143470b6-2ee8-42cc-a086-aea36b72ec66"}
{"abstract": "In this paper, a compact high isolation 14–18 GHz SPDT switch using triple-well transistors based on 0.35µm SiGe BiCMOS process is proposed. Improved series-shunt-shunt topology is used in this design to increase the isolation and to reduce the insertion loss concurrently. In order to improve the power handling capability, body-floating technique is employed and analyzed. The simulation results shown that in the interested frequency band of 14–18 GHz, the insertion loss of the ON state path is better than 1.5 dB, and the isolation of the OFF state path is higher than 44dB. The P1dB of the ON state path at center frequency 15.5 GHz is 13dBm, and the chip size is 0.125 mm 2 .", "authors": ["Wenju Li", "Kaixue Ma", "Shouxian Mou"], "n_citation": 0, "references": [], "title": "A Ku-band high-isolation SPDT switch in 0.35um SiGe BiCMOS technology", "venue": "", "year": 2016, "id": "144ca465-2ce0-47d5-9588-54df33b83536"}
{"abstract": "Advanced personalized web applications require a carefully dealing with their users' wishes and preferences. Since such preferences do not always hold in general, personalized applications also have to consider the user's current situation. In this paper we present a novel framework for modeling situations and situated preferences. Our approach consists of a general meta model for situations, which can be applied as foundation for situation models in a wide range of applications. Furthermore, an XML-based preference repository for the storage and management of situated preferences is developed. Long-term and situated preferences can easily be accessed with the preference repository interface. Particularly, preferences best-matching to a given situation can be queried. This approach allows web applications to react flexibly and personalized to the changing situations of their users.", "authors": ["Stefan Holland", "W. Kiessling"], "n_citation": 0, "title": "Situated preferences and preference repositories for personalized database applications", "venue": "Lecture Notes in Computer Science", "year": 2004, "id": "146feca7-deba-4472-9f3e-1772ffbcd100"}
{"abstract": "In this paper a tool based on the g m /I D -methodology is presented to provide information on operating point-dependent degradation in integrated circuits caused by NBTI and HCI during early design stages. The advantage of the presented GMID-Tool is that it does not require any further SPICE or aging simulations after the extraction of the fest and aged small signal parameters of a single transistor. Using the GMID-Tool, the design time of an integrated circuit is reduced significantly. In addition, the GMID-Tool is process-independent and universally applicable as it takes technology specific data as input. The verification of the GMID-Tool is shown at the example of a Common-Source Amplifier and a Miller-OTA.", "authors": ["Theodor Hillebrand", "Timur Schäfer", "Nico Hellwege", "Marco Erstling", "Dagmar Peters-Drolshagen", "Steffen Paul"], "n_citation": 0, "references": ["0f9955dd-81bb-4b96-a938-b7769a8d12a9", "115715e0-3059-4d05-8970-a175a7ef81a7"], "title": "Design and verification of analog CMOS circuits using the g m /I D -method with age-dependent degradation effects", "venue": "power and timing modeling optimization and simulation", "year": 2016, "id": "14af3736-2484-4432-841a-cd8960481b58"}
{"authors": ["Toshio Fukuda", "Motohiro Fujiyoshi", "Fumihito Arai", "Hideo Matsuura"], "n_citation": 0, "title": "Position and Force Control of Micromanipulatorwith Six Degrees of Freedom Using Piezoelectric Actuators.", "venue": "", "year": 1991, "id": "14b53bdb-2c05-4af2-a159-7aee0d4e8f8a"}
{"abstract": "This paper studies how to adjoin probability to event structures, leading to the model of probabilistic event structures. In their simplest form probabilistic choice is localised to cells, where conflict arises; in which case probabilistic independence coincides with causal independence. An application to the semantics of a probabilistic CCS is sketched. An event structure is associated with a domain-that of its configurations ordered by inclusion. In domain theory probabilistic processes are denoted by continuous valuations on a domain. A key result of this paper is a representation theorem showing how continuous valuations on the domain of a confusion-free event structure correspond to the probabilistic event structures it supports. We explore how to extend probability to event structures which are not confusion-free via two notions of probabilistic runs of a general event structure. Finally, we show how probabilistic correlation and probabilistic event structures with confusion can arise from event structures which are originally confusion-free by using morphisms to rename and hide events.", "authors": ["Daniele Varacca", "Hagen Völzer", "Glynn Winskel"], "n_citation": 50, "title": "Probabilistic event structures and domains", "venue": "Lecture Notes in Computer Science", "year": 2004, "id": "14c7fdc4-4c54-4424-96fd-bac291f034fd"}
{"abstract": "Low sidelobes are important and essential in all SAR (Synthetic Aperture Radar) images, regardless of the imaging mode, for fewer artificial targets. For strip-map mode all targets overlap in frequency, which is convenient to suppress sidelobes. However, weighting requires total overlap in the time or frequency domain, which a sliding spotlight signal could not satisfy. Furthermore, the wavelength cannot be regarded as a constant value under the condition of a wideband chirp signal, which leads to the variation of the Doppler bandwidth along with the range frequency. In this article, an azimuth weighting method is proposed that considers the influence of a wideband based on a two-step algorithm. The computer simulation is given to verify the presented method.", "authors": ["Feng Xiao", "Zegang Ding", "Bin Xiong Bin Xiong", "Teng Long"], "n_citation": 0, "references": ["518a693f-c4ac-4b30-a76b-94ea9a186d34", "5d615d8b-fbfc-495c-8dd5-9396e8bb580d", "6461f523-2e48-4621-a97c-4243f48662dc", "8daaabef-18be-4815-9beb-442a3ecbd162", "8f5a807a-0614-4559-ae7f-3a99bdaef0ff", "9156a841-4e2b-4cd4-ae49-5f8107db8618", "9985cd10-82ff-4236-8cdf-897170c87ce2", "cf276c9d-c0a5-4200-b3b7-0e10e4429d96", "daf93e32-089a-450b-b2c0-8fc9348e463c", "dcc45570-5f72-48ce-9623-2c878da28925"], "title": "A Modified Azimuth Weighting Method in a Two-Step Process Approach for Sliding Spotlight Data Processing", "venue": "Sensors", "year": 2017, "id": "158a44ed-7619-4764-a545-7257f7e96643"}
{"authors": ["Jung S. Kim", "Nam Ik Cho", "Seok-Cheol Kee", "Sang Uk Lee"], "n_citation": 0, "title": "Facial feature tracking by robust face segmentation and scalable rotational BMA.", "venue": "visual communications and image processing", "year": 2002, "id": "15bee46a-e30c-4e70-8250-63a8f562f257"}
